{
    "version": "https://jsonfeed.org/version/1",
    "title": "Ha3ks.com - for nerds",
    "home_page_url": "https://www.ha3ks.com/",
    "feed_url": "https://www.ha3ks.com/feed.json",
    "description": "Ha3ks.com - for nerds",
    "icon": "https://www.ha3ks.com/assets/images/apple-touch-icon.png",
    "favicon": "https://www.ha3ks.com/assets/images/favicon.png",
    "expired": false,
    
    "author":  {
        "name": "Dan Murray",
        "url": null,
        "avatar": null
    },
    
"items": [
    
        {
            "id": "https://www.ha3ks.com/weekly-recap/",
            "title": "Weekly Recap",
            "summary": null,
            "content_text": "I have decided to try doing a weekly update of my learning/experiences for previous days.I have no idea if this will be popular or a good idea but at least it is something.And per my mumblings further down, least it shows I am actually doing somehting.02/02/2026WarmupStarting February by relearning TryHackMe. I don’t know if I will stream this but Imposter Syndrome hits hard sometimes and my usual brain screams ‘I don’t know what I am doing’ so I tear down everything and start again… Today is no different, he says with a completely reset and rebuilt VIP account… Paid this time instead of bugged out and free for an entire year and a half (it seems), This time will be different. It has to be. I know where I want to be in life and there is one way to get there - HARD WORK.I asked ChatGPT recently for some advice on this and ended up making a fairly solid game plan - 2 hours a day on weekdays:15 mins warm up90 mins actual work15 mins cool down and review.. take notes and summarize where I got to.What I want to do:  Better hacker  Solid Fundamentals  Actually learn, no shortcuts and only refer to a walkthrough when stuck (stuck timer?)  Share the journey?  Actually show I know this stuff, I’m not as stupid as I think I am, I am better I just need to prove it to myself…. - Eliminate self doubt.It’s not an exhaustive list, but its one I want to work on, for all I know there could be changes made, or things added, lets see what happens with this first 5 days.Deep Focus/Learning  Completed Offensive Security Intro  Completed Defensive Security Intro  Completed Careers in Cyber  Completed What is Networking?  Completed Intro to Lan  Completed OSI ModelWrap UpDid the quiz in Careers in Cyber and lo and behold,,, Red TeamerI want to be a red teamer and this thinks I should be one so….Fair amount of ‘intro’ machines done today. Felt good to be getting back into it. I know, quite obviously, that future hacking will not be ‘hey read this and the answer is revealed’ most of the machines will be ‘deposit user and root flags’ type scenarios and also along that path of Red Teamer a lot more complex and fun things will be hiding… I look forward to it.I need to make myself aware that not everything will be easy mode, some things will be complex and require a lot of testing and thinking, same with re-sitting (eventually) the OSCP, IT IS GOING TO TAKE TIME! so spend it correctly and get that win!03/02/2026WarmupOk kicking things off today, I want to recap yesterday, from what I recall I completed a lot of the ‘info’/’intro’ rooms, this is to be expected given that I am on the first path on the platform - Pre Security, after that they next path will be Cyber Security 101 which will be a little more interesting then after that and as per my quiz results I am going straight down the Penetration tester path.It is unlikely I will get any of the certifications along this path as, money, but least I can hammer out the learning and then start to focus on machines.I figure doing the same thing I did with Hack The Box back in the day, hit every ‘easy’ machine then move onto the mediums, hards and insanes.At that point I want to swap out my TryHackMe VIP for a Hack The Box subscription as by that time the rust should be cleared off and I should be able to perform as well as I used to with things flowing back into my mindset.The time to get dangerous again, is now.I am also trying to use just one screen, just the laptop. While it is nice to have my monitor as well for all the extra 1080p screen real estate I can get, I kinda want to downsize a little and go a little more minimal.. Will it work? Maybe…Deep down I cant wait to get the sensory room/office sorted so my gear has a permanent home again, then I can splurge out a little… If I get a job I can finally sort out my dream setup of having a decent Mac and glorious big screen, maybe even curved(?) but I digress, trying new things.Deep Focus/Learning  Completed Extending your Network  Completed DNS in Detail  Completed HTTP in Detail  Completed How Websites Work  Completed Putting it all together  Completed Linux Fundamentals Part 1  Completed Linux Fundamentals Part 2Check CronJobs withcrontab -e  Completed Linux Fundamentals Part 3Wrap UpManaged to get a lot done today, jumped to the top of the bronze league leader board… Not that I care about that, I know there are badges and stuff for it but I literally don’t give a shit, I am here for the learning not for the league.Googled an interesting reminder for checking cronjobs running on Linux, strangely enough I was able to read and answer questions quite well and quite quickly though this is because I already know all this and the rust is starting to get work off, I become a machine once more… eventually.I didn’t get distracted today or need any external reminders (aside from Binaural Beats playing in my headphones).Even being able to get the Windows Timer to hover in the corner helped.. One Screen and all that…My experiment worked pretty will using just the laptop and mouse.I did use the keyboard but that was only because my laptop couldn’t be brought forwards to the pull out drawer and as such more comfortable on the sofa.Perhaps after this period today I can remove the keyboard, rewire some stuff and test the headphones directly into the laptop again, if all is well I can take the monitor back upstairs for now and settle into a minimalism desk again… I want to empty out my backpack and really clear things down.. I don’t need all the faff just the things that work.I still dream of a nice MacBook and maybe one day that will happen but for now Windows will have to do…I feel like, so far, this system is working.. In my head I know I can do more and add an extra hour in and what not but I really want to give this thing a proper try, avoid burnout and really grow and develop.Part of my mind debates if I should copy paste all this and dump it as a weekly blog post update, mainly because content but also to show people that I am not just sat around with my thumb in my arse.I potentially may end up working in a NOC/SOC but being a Red Teamer in a Blue Team field means I have a pretty good idea how a Threat Actor would come in, or better still how to stop it from every becoming a thing…. I digress.So far I am loving this newer, kinda more ‘relaxed’ way of doing things, I wonder how for I can go in ‘just’ 4 weeks…I feel like when I get through all this ‘info’ stuff and actually start going after machines, my notes will be getting a lot more filled up. May have to use pages with bullet points to make things neater then each machine with its own dedicated page can just have an ass load of content, scripts, results, notes, screenshots etc so its all correlated in one specific place, more on that later though.04/02/2026WarmupDid a fair amount of exercise this morning, ended up doing 44 mins strength and a 25 minute walk at ~3mph, not bad when your legs are in agony from lifting and an inconveniently placed newly developed skin tag…From what I recall from yesterday I really felt myself getting into some kind of flow state, relaxing and just cracking on with the objective, I am hopeful today I can finish off this Pre Security path and move onto the Cyber Security 101 path, strangely because of the pre path (at present) 10% of the 101 is done.This is one of the downsides to TryHackMe. I really wish the training was ‘siloed’ into the specific sections, so there is no chance of completing something before you get there and letting you get on with the flow.Tiny problem I know but perhaps they could, instead of recycling the content for some sections, approach it in a new way or do a recap and then some more ‘in depth’ that would be awesome.I find it funny that, for the most part people who were ‘influencers’ during the Advent of Cyber only did it for that and since then have had little to no new activity… yeah people have jobs and lives etc. but I thought there was supposed to be some engagement with the community(?)… I could be wrong and what the hell do I know about being an ‘influencer’.I think it’s interesting that I am, so far anyway, sticking to the plan of doing work on certain days, I know places like THM have a focus on streaks etc but I really don’t care about them. It’s easy to get the 365 days badge and whatnot just by doing 1 action per day, its dumb.I removed the monitor and the keyboard from my setup now so its just me, this desk from the school for the blind and my laptop. I can sit back on the sofa and get cracking.Deep Focus/Learning  Completed Windows Fundamentals 1  Completed Windows Fundamentals 2      Completed Windows Fundamentals 3    Finished Pre Security path and awarded certificate (took roughly 3 and a half hours in total)        Cyber Security 101 is at present 15% complete after doing Pre Security, Noted Web Fundamentals in the Penetration Tester Path is also 16% completed, this annoys me but I get whey they have spill over given what is actually available on the platform.  Started Cyber Security 101 path 54 mins remaining on clock for this session.  Completed Search Skills      Completed Active Directory Basics      tasklist /FI \"imagename eq notepad.exe” ## Kills notepad from the command line can change to other exe's        Completed Windows Command Line  Completed Windows PowerShell  Completed Linux Scripts  Completed Networking ConceptsWrap UpManaged to smash out quite a good few rooms today, I feel like I am starting to become the analyst I was before… focused, disciplined.. sharp.Completed the Pre Security Path and started chopping my way through Cyber Security 101.I have to admit a few times I caught myself reading something and accidently picking up on the next answer to a question, annoying but what do you expect when everyone has already done all these rooms and paths and all the information is freely available on the internet for all to see.When I get around to machines things might be a little easier for googling and checking my math with avoiding the walkthroughs, can only hope mind.AI summarization on the internet is an absolute bastard, it killed StackOverflow and it is going to kill more things, yes its easier but it leaves corpses in its path.It was a little harder to concentrate today, not because I’m sore, it’s because of musical earworms getting in and interrupting my flow, need to deal with that better, FWIW the Binaural Beats seems to be helping, keeping interesting tones and whatnot constantly feeding my brain while I work has helped before and it will continue to do so now.I wonder about not only using TryHackMe for my ‘education’ side of things, I think about cracking on with HTB academy too, though their cubes system can be an arse as you only have a limited amount and after that you run out of training, I do enjoy their training material but its difficult to split between the two when you are ‘out of work’ so to speak so have to find some way of footing the bill…So far this week, this year, I have dedicated 270 minutes (4.5 hours) to focused learning, seems to be working but I really need to push this number up higher.Now I build my body and my brain.05/02/2026WarmupOk so did my exercises, did the pots, fed the animals, quick walk to the shop and met 2 Great Pyrenees. This day is awesome.From what I recall yesterday I am now progressing through the Cyber Security 101 Path, the basics of Cyber Security so should be relatively straightforward and let me focus and crack on.Trying my knock off AirPods Pros today, mainly because I found them again while sorting through some stuff and majorly because I can’t keep wearing the massive Corsair Headset I have.I also don’t want to faff around pairing my actual Airpods (Gen 4s not pros and I do regret it) from my phone to my laptop and back again… it’s annoying switching Bluetooth off and on for each device etc. so as I have 2 I can use 2… very minimalist…I’ve been thinking about my friends in the field a lot lately.. literal wizards of Cyber Security, Analysis, Malware, Defence its all so cool and I really want to be there with them and operating on the same level.. there’s nothing to it but to do it, same as my health and that I definitely need to keep an eye on.Deep Focus/Learning  Completed Networking Essentials| Protocol | Transport Protocol | Default Port Number || — | — | — || TELNET | TCP | 23 || DNS | UDP or TCP | 53 || HTTP | TCP | 80 || HTTPS | TCP | 443 || FTP | TCP | 21 || SMTP | TCP | 25 || POP3 | TCP | 110 || IMAP | TCP | 143 |  Completed Networking Core Protocols  Completed Networking Secure Protocols  Completed Wireshark The Basics            Command      Explanation                  tcpdump -i INTERFACE      Captures packets on a specific network interface              tcpdump -w FILE      Writes captured packets to a file              tcpdump -r FILE      Reads captured packets from a file              tcpdump -c COUNT      Captures a specific number of packets              tcpdump -n      Don’t resolve IP addresses              tcpdump -nn      Don’t resolve IP addresses and don’t resolve protocol numbers              tcpdump -v      Verbose display; verbosity can be increased with -vv and -vvv                  Command      Explanation                  tcpdump host IP or tcpdump host HOSTNAME      Filters packets by IP address or hostname              tcpdump src host IP or      Filters packets by a specific source host              tcpdump dst host IP      Filters packets by a specific destination host              tcpdump port PORT_NUMBER      Filters packets by port number              tcpdump src port PORT_NUMBER      Filters packets by the specified source port number              tcpdump dst port PORT_NUMBER      Filters packets by the specified destination port number              tcpdump PROTOCOL      Filters packets by protocol; examples include ip, ip6, and icmp      | Command | Explanation || — | — || tcpdump -q | Quick and quite: brief packet information || tcpdump -e | Include MAC addresses || tcpdump -A | Print packets as ASCII encoding || tcpdump -xx | Display packets in hexadecimal format || tcpdump -X | Show packets in both hexadecimal and ASCII formats |  Completed TCPdump The Basics| Option | Explanation || — | — || -sL | List scan – list targets without scanning || Host Discovery |  || -sn | Ping scan – host discovery only || Port Scanning |  || -sT | TCP connect scan – complete three-way handshake || -sS | TCP SYN – only first step of the three-way handshake || -sU | UDP Scan || -F | Fast mode – scans the 100 most common ports || -p[range] | Specifies a range of port numbers – -p- scans all the ports || -Pn | Treat all hosts as online – scan hosts that appear to be down || Service Detection |  || -O | OS detection || -sV | Service version detection || -A | OS detection, version detection, and other additions || Timing |  || -T&lt;0-5&gt; | Timing template – paranoid (0), sneaky (1), polite (2), normal (3), aggressive (4), and insane (5) || --min-parallelism &lt;numprobes&gt; and --max-parallelism &lt;numprobes&gt; | Minimum and maximum number of parallel probes || --min-rate &lt;number&gt; and --max-rate &lt;number&gt; | Minimum and maximum rate (packets/second) || --host-timeout | Maximum amount of time to wait for a target host || Real-time output |  || -v | Verbosity level – for example, -vv and -v4 || -d | Debugging level – for example -d and -d9 || Report |  || -oN &lt;filename&gt; | Normal output || -oX &lt;filename&gt; | XML output || -oG &lt;filename&gt; | grep-able output || -oA &lt;basename&gt; | Output in all major formats |  Completed Nmap The Basics  Completed Cryptography BasicsWrap UpAnother day, another dollar.I really feel like these sessions and this framework, specifically sticking to a 15 min warmup and an ending recap are helping.From the materials today, even though this is all in my head already I decided to copy paste some of the commands for TCP dump and Nmap, I really enjoyed getting to grips with Wireshark again, I really need to get better at using it and being able to read things in it. perhaps I could spend a day on that or its associated rooms when I get a chance, for now I am sticking with the paths and going off that once I get them hammered out.I had to change back to my headset as the AirPods just wouldn’t sit comfortable for me,, could be the fact they are knock offs and the sound is way off…. probably is actually now I think about it, I’ll put them back in the box where I found them and figure out something I can do with them later.For now back to my regular post training and exercise life and that means back to house jobs.06/02/2026NotesMy Laptop took a shit today.. Cathrine tells me its ‘clearly user error’ so perhaps I am cursed or some shit but these issues with windows are really getting on my nerves.I am actually writing this on Saturday (07/02/2026) having got the laptop back into a working state, even windows updates are now correctly installing.I considered picking back up THM today and getting that missing 90 minutes focussed learning in but my head isn’t in the game today.. all the hell I went through yesterday (up till 11pm at night) just to get this machine working again really burned me out.I am also taking the weekend as rest days on exercise (yeh you try throwing around a kettlebell with an 11 year old in the room) so per my ChatGPT idea.. I rest today and tomorrow and come back strong on Monday.I may end up hitting machines on Hack The Box sooner then I think (considered for weeks 9-12) as the rust definitely comes off when you are in that flow state.Ill see you next week for the next update post.🤙I don’t have any sponsors or anything but if you enjoy my work, or feel sympathy for my wife, then I have set up a Ko-Fi account as well as a BuyMeACoffee people can donate to.",
            "content_html": "<p>I have decided to try doing a weekly update of my learning/experiences for previous days.</p><p>I have no idea if this will be popular or a good idea but at least it is something.</p><p>And per my mumblings further down, least it shows I am actually doing somehting.</p><h1 id=\"02022026\">02/02/2026</h1><h2 id=\"warmup\">Warmup</h2><p>Starting February by relearning TryHackMe. I don’t know if I will stream this but Imposter Syndrome hits hard sometimes and my usual brain screams ‘I don’t know what I am doing’ so I tear down everything and start again… Today is no different, he says with a completely reset and rebuilt VIP account… Paid this time instead of bugged out and free for an entire year and a half (it seems), This time will be different. It has to be. I know where I want to be in life and there is one way to get there - HARD WORK.</p><p>I asked ChatGPT recently for some advice on this and ended up making a fairly solid game plan - 2 hours a day on weekdays:</p><p>15 mins warm up</p><p>90 mins actual work</p><p>15 mins cool down and review.. take notes and summarize where I got to.</p><p>What I want to do:</p><ul>  <li>Better hacker</li>  <li>Solid Fundamentals</li>  <li>Actually learn, no shortcuts and only refer to a walkthrough when stuck (stuck timer?)</li>  <li>Share the journey?</li>  <li>Actually show I know this stuff, I’m not as stupid as I think I am, I am better I just need to prove it to myself…. - Eliminate self doubt.</li></ul><p>It’s not an exhaustive list, but its one I want to work on, for all I know there could be changes made, or things added, lets see what happens with this first 5 days.</p><h2 id=\"deep-focuslearning\">Deep Focus/Learning</h2><ul>  <li>Completed Offensive Security Intro</li>  <li>Completed Defensive Security Intro</li>  <li>Completed Careers in Cyber</li></ul><p><img src=\"/assets/blog/07-02-2026/1.png\" alt=\"1\" /></p><ul>  <li>Completed What is Networking?</li>  <li>Completed Intro to Lan</li></ul><p><img src=\"/assets/blog/07-02-2026/2.png\" alt=\"2\" /></p><ul>  <li>Completed OSI Model</li></ul><h2 id=\"wrap-up\">Wrap Up</h2><p>Did the quiz in Careers in Cyber and lo and behold,,, Red Teamer</p><p><img src=\"/assets/blog/07-02-2026/3.png\" alt=\"3\" /></p><p><img src=\"/assets/blog/07-02-2026/4.png\" alt=\"4\" /></p><p>I want to be a red teamer and this thinks I should be one so….</p><p>Fair amount of ‘intro’ machines done today. Felt good to be getting back into it. I know, quite obviously, that future hacking will not be ‘hey read this and the answer is revealed’ most of the machines will be ‘deposit user and root flags’ type scenarios and also along that path of Red Teamer a lot more complex and fun things will be hiding… I look forward to it.</p><p>I need to make myself aware that not everything will be easy mode, some things will be complex and require a lot of testing and thinking, same with re-sitting (eventually) the OSCP, IT IS GOING TO TAKE TIME! so spend it correctly and get that win!</p><h2 id=\"03022026\">03/02/2026</h2><h2 id=\"warmup-1\">Warmup</h2><p>Ok kicking things off today, I want to recap yesterday, from what I recall I completed a lot of the ‘info’/’intro’ rooms, this is to be expected given that I am on the first path on the platform - Pre Security, after that they next path will be Cyber Security 101 which will be a little more interesting then after that and as per my quiz results I am going straight down the Penetration tester path.</p><p>It is unlikely I will get any of the certifications along this path as, money, but least I can hammer out the learning and then start to focus on machines.</p><p>I figure doing the same thing I did with Hack The Box back in the day, hit every ‘easy’ machine then move onto the mediums, hards and insanes.</p><p>At that point I want to swap out my TryHackMe VIP for a Hack The Box subscription as by that time the rust should be cleared off and I should be able to perform as well as I used to with things flowing back into my mindset.</p><p>The time to get dangerous again, is now.</p><p>I am also trying to use just one screen, just the laptop. While it is nice to have my monitor as well for all the extra 1080p screen real estate I can get, I kinda want to downsize a little and go a little more minimal.. Will it work? Maybe…</p><p>Deep down I cant wait to get the sensory room/office sorted so my gear has a permanent home again, then I can splurge out a little… If I get a job I can finally sort out my dream setup of having a decent Mac and glorious big screen, maybe even curved(?) but I digress, trying new things.</p><h2 id=\"deep-focuslearning-1\">Deep Focus/Learning</h2><ul>  <li>Completed Extending your Network</li>  <li>Completed DNS in Detail</li>  <li>Completed HTTP in Detail</li>  <li>Completed How Websites Work</li>  <li>Completed Putting it all together</li>  <li>Completed Linux Fundamentals Part 1</li>  <li>Completed Linux Fundamentals Part 2</li></ul><p>Check CronJobs with</p><div class=\"language-bash highlighter-rouge\"><div class=\"highlight\"><pre class=\"highlight\"><code>crontab <span class=\"nt\">-e</span></code></pre></div></div><ul>  <li>Completed Linux Fundamentals Part 3</li></ul><h2 id=\"wrap-up-1\">Wrap Up</h2><p>Managed to get a lot done today, jumped to the top of the bronze league leader board… Not that I care about that, I know there are badges and stuff for it but I literally don’t give a shit, I am here for the learning not for the league.</p><p>Googled an interesting reminder for checking cronjobs running on Linux, strangely enough I was able to read and answer questions quite well and quite quickly though this is because I already know all this and the rust is starting to get work off, I become a machine once more… eventually.</p><p>I didn’t get distracted today or need any external reminders (aside from Binaural Beats playing in my headphones).</p><p>Even being able to get the Windows Timer to hover in the corner helped.. One Screen and all that…</p><p>My experiment worked pretty will using just the laptop and mouse.</p><p>I did use the keyboard but that was only because my laptop couldn’t be brought forwards to the pull out drawer and as such more comfortable on the sofa.</p><p>Perhaps after this period today I can remove the keyboard, rewire some stuff and test the headphones directly into the laptop again, if all is well I can take the monitor back upstairs for now and settle into a minimalism desk again… I want to empty out my backpack and really clear things down.. I don’t need all the faff just the things that work.</p><p>I still dream of a nice MacBook and maybe one day that will happen but for now Windows will have to do…</p><p>I feel like, so far, this system is working.. In my head I know I can do more and add an extra hour in and what not but I really want to give this thing a proper try, avoid burnout and really grow and develop.</p><p>Part of my mind debates if I should copy paste all this and dump it as a weekly blog post update, mainly because content but also to show people that I am not just sat around with my thumb in my arse.</p><p>I potentially may end up working in a NOC/SOC but being a Red Teamer in a Blue Team field means I have a pretty good idea how a Threat Actor would come in, or better still how to stop it from every becoming a thing…. I digress.</p><p>So far I am loving this newer, kinda more ‘relaxed’ way of doing things, I wonder how for I can go in ‘just’ 4 weeks…</p><p>I feel like when I get through all this ‘info’ stuff and actually start going after machines, my notes will be getting a lot more filled up. May have to use pages with bullet points to make things neater then each machine with its own dedicated page can just have an ass load of content, scripts, results, notes, screenshots etc so its all correlated in one specific place, more on that later though.</p><h2 id=\"04022026\">04/02/2026</h2><h2 id=\"warmup-2\">Warmup</h2><p>Did a fair amount of exercise this morning, ended up doing 44 mins strength and a 25 minute walk at ~3mph, not bad when your legs are in agony from lifting and an inconveniently placed newly developed skin tag…</p><p>From what I recall from yesterday I really felt myself getting into some kind of flow state, relaxing and just cracking on with the objective, I am hopeful today I can finish off this Pre Security path and move onto the Cyber Security 101 path, strangely because of the pre path (at present) 10% of the 101 is done.</p><p>This is one of the downsides to TryHackMe. I really wish the training was ‘siloed’ into the specific sections, so there is no chance of completing something before you get there and letting you get on with the flow.</p><p>Tiny problem I know but perhaps they could, instead of recycling the content for some sections, approach it in a new way or do a recap and then some more ‘in depth’ that would be awesome.</p><p>I find it funny that, for the most part people who were ‘influencers’ during the Advent of Cyber only did it for that and since then have had little to no new activity… yeah people have jobs and lives etc. but I thought there was supposed to be some engagement with the community(?)… I could be wrong and what the hell do I know about being an ‘influencer’.</p><p>I think it’s interesting that I am, so far anyway, sticking to the plan of doing work on certain days, I know places like THM have a focus on streaks etc but I really don’t care about them. It’s easy to get the 365 days badge and whatnot just by doing 1 action per day, its dumb.</p><p>I removed the monitor and the keyboard from my setup now so its just me, this desk from the school for the blind and my laptop. I can sit back on the sofa and get cracking.</p><h2 id=\"deep-focuslearning-2\">Deep Focus/Learning</h2><ul>  <li>Completed Windows Fundamentals 1</li>  <li>Completed Windows Fundamentals 2</li>  <li>    <p>Completed Windows Fundamentals 3</p>    <p>Finished Pre Security path and awarded certificate (took roughly 3 and a half hours in total)</p>    <p><img src=\"/assets/blog/07-02-2026/5.png\" alt=\"5\" /></p>  </li>  <li>Cyber Security 101 is at present 15% complete after doing Pre Security, Noted Web Fundamentals in the Penetration Tester Path is also 16% completed, this annoys me but I get whey they have spill over given what is actually available on the platform.</li>  <li>Started Cyber Security 101 path 54 mins remaining on clock for this session.</li>  <li>Completed Search Skills</li>  <li>    <p>Completed Active Directory Basics</p>    <div class=\"language-bash highlighter-rouge\"><div class=\"highlight\"><pre class=\"highlight\"><code>  tasklist /FI <span class=\"s2\">\"imagename eq notepad.exe” ## Kills notepad from the command line can change to other exe's</span></code></pre></div>    </div>  </li>  <li>Completed Windows Command Line</li>  <li>Completed Windows PowerShell</li>  <li>Completed Linux Scripts</li>  <li>Completed Networking Concepts</li></ul><h2 id=\"wrap-up-2\">Wrap Up</h2><p>Managed to smash out quite a good few rooms today, I feel like I am starting to become the analyst I was before… focused, disciplined.. sharp.</p><p>Completed the Pre Security Path and started chopping my way through Cyber Security 101.</p><p>I have to admit a few times I caught myself reading something and accidently picking up on the next answer to a question, annoying but what do you expect when everyone has already done all these rooms and paths and all the information is freely available on the internet for all to see.</p><p>When I get around to machines things might be a little easier for googling and checking my math with avoiding the walkthroughs, can only hope mind.</p><p>AI summarization on the internet is an absolute bastard, it killed StackOverflow and it is going to kill more things, yes its easier but it leaves corpses in its path.</p><p>It was a little harder to concentrate today, not because I’m sore, it’s because of musical earworms getting in and interrupting my flow, need to deal with that better, FWIW the Binaural Beats seems to be helping, keeping interesting tones and whatnot constantly feeding my brain while I work has helped before and it will continue to do so now.</p><p>I wonder about not only using TryHackMe for my ‘education’ side of things, I think about cracking on with HTB academy too, though their cubes system can be an arse as you only have a limited amount and after that you run out of training, I do enjoy their training material but its difficult to split between the two when you are ‘out of work’ so to speak so have to find some way of footing the bill…</p><p>So far this week, this year, I have dedicated 270 minutes (4.5 hours) to focused learning, seems to be working but I really need to push this number up higher.</p><p>Now I build my body and my brain.</p><h2 id=\"05022026\">05/02/2026</h2><h2 id=\"warmup-3\">Warmup</h2><p>Ok so did my exercises, did the pots, fed the animals, quick walk to the shop and met 2 Great Pyrenees. This day is awesome.</p><p>From what I recall yesterday I am now progressing through the Cyber Security 101 Path, the basics of Cyber Security so should be relatively straightforward and let me focus and crack on.</p><p>Trying my knock off AirPods Pros today, mainly because I found them again while sorting through some stuff and majorly because I can’t keep wearing the massive Corsair Headset I have.</p><p>I also don’t want to faff around pairing my actual Airpods (Gen 4s not pros and I do regret it) from my phone to my laptop and back again… it’s annoying switching Bluetooth off and on for each device etc. so as I have 2 I can use 2… very minimalist…</p><p>I’ve been thinking about my friends in the field a lot lately.. literal wizards of Cyber Security, Analysis, Malware, Defence its all so cool and I really want to be there with them and operating on the same level.. there’s nothing to it but to do it, same as my health and that I definitely need to keep an eye on.</p><h2 id=\"deep-focuslearning-3\">Deep Focus/Learning</h2><ul>  <li>Completed Networking Essentials</li></ul><p>| <strong>Protocol</strong> | <strong>Transport Protocol</strong> | <strong>Default Port Number</strong> || — | — | — || TELNET | TCP | 23 || DNS | UDP or TCP | 53 || HTTP | TCP | 80 || HTTPS | TCP | 443 || FTP | TCP | 21 || SMTP | TCP | 25 || POP3 | TCP | 110 || IMAP | TCP | 143 |</p><ul>  <li>Completed Networking Core Protocols</li>  <li>Completed Networking Secure Protocols</li>  <li>Completed Wireshark The Basics</li></ul><table>  <thead>    <tr>      <th><strong>Command</strong></th>      <th><strong>Explanation</strong></th>    </tr>  </thead>  <tbody>    <tr>      <td><code class=\"language-plaintext highlighter-rouge\">tcpdump -i INTERFACE</code></td>      <td>Captures packets on a specific network interface</td>    </tr>    <tr>      <td><code class=\"language-plaintext highlighter-rouge\">tcpdump -w FILE</code></td>      <td>Writes captured packets to a file</td>    </tr>    <tr>      <td><code class=\"language-plaintext highlighter-rouge\">tcpdump -r FILE</code></td>      <td>Reads captured packets from a file</td>    </tr>    <tr>      <td><code class=\"language-plaintext highlighter-rouge\">tcpdump -c COUNT</code></td>      <td>Captures a specific number of packets</td>    </tr>    <tr>      <td><code class=\"language-plaintext highlighter-rouge\">tcpdump -n</code></td>      <td>Don’t resolve IP addresses</td>    </tr>    <tr>      <td><code class=\"language-plaintext highlighter-rouge\">tcpdump -nn</code></td>      <td>Don’t resolve IP addresses and don’t resolve protocol numbers</td>    </tr>    <tr>      <td><code class=\"language-plaintext highlighter-rouge\">tcpdump -v</code></td>      <td>Verbose display; verbosity can be increased with <code class=\"language-plaintext highlighter-rouge\">-vv</code> and <code class=\"language-plaintext highlighter-rouge\">-vvv</code></td>    </tr>  </tbody></table><table>  <thead>    <tr>      <th><strong>Command</strong></th>      <th><strong>Explanation</strong></th>    </tr>  </thead>  <tbody>    <tr>      <td><code class=\"language-plaintext highlighter-rouge\">tcpdump host IP</code> or <code class=\"language-plaintext highlighter-rouge\">tcpdump host HOSTNAME</code></td>      <td>Filters packets by IP address or hostname</td>    </tr>    <tr>      <td><code class=\"language-plaintext highlighter-rouge\">tcpdump src host IP</code> or</td>      <td>Filters packets by a specific source host</td>    </tr>    <tr>      <td><code class=\"language-plaintext highlighter-rouge\">tcpdump dst host IP</code></td>      <td>Filters packets by a specific destination host</td>    </tr>    <tr>      <td><code class=\"language-plaintext highlighter-rouge\">tcpdump port PORT_NUMBER</code></td>      <td>Filters packets by port number</td>    </tr>    <tr>      <td><code class=\"language-plaintext highlighter-rouge\">tcpdump src port PORT_NUMBER</code></td>      <td>Filters packets by the specified source port number</td>    </tr>    <tr>      <td><code class=\"language-plaintext highlighter-rouge\">tcpdump dst port PORT_NUMBER</code></td>      <td>Filters packets by the specified destination port number</td>    </tr>    <tr>      <td><code class=\"language-plaintext highlighter-rouge\">tcpdump PROTOCOL</code></td>      <td>Filters packets by protocol; examples include <code class=\"language-plaintext highlighter-rouge\">ip</code>, <code class=\"language-plaintext highlighter-rouge\">ip6</code>, and <code class=\"language-plaintext highlighter-rouge\">icmp</code></td>    </tr>  </tbody></table><p>| <strong>Command</strong> | <strong>Explanation</strong> || — | — || <code class=\"language-plaintext highlighter-rouge\">tcpdump -q</code> | Quick and quite: brief packet information || <code class=\"language-plaintext highlighter-rouge\">tcpdump -e</code> | Include MAC addresses || <code class=\"language-plaintext highlighter-rouge\">tcpdump -A</code> | Print packets as ASCII encoding || <code class=\"language-plaintext highlighter-rouge\">tcpdump -xx</code> | Display packets in hexadecimal format || <code class=\"language-plaintext highlighter-rouge\">tcpdump -X</code> | Show packets in both hexadecimal and ASCII formats |</p><ul>  <li>Completed TCPdump The Basics</li></ul><p>| <strong>Option</strong> | <strong>Explanation</strong> || — | — || <code class=\"language-plaintext highlighter-rouge\">-sL</code> | List scan – list targets without scanning || <strong><em>Host Discovery</em></strong> |  || <code class=\"language-plaintext highlighter-rouge\">-sn</code> | Ping scan – host discovery only || <strong><em>Port Scanning</em></strong> |  || <code class=\"language-plaintext highlighter-rouge\">-sT</code> | TCP connect scan – complete three-way handshake || <code class=\"language-plaintext highlighter-rouge\">-sS</code> | TCP SYN – only first step of the three-way handshake || <code class=\"language-plaintext highlighter-rouge\">-sU</code> | UDP Scan || <code class=\"language-plaintext highlighter-rouge\">-F</code> | Fast mode – scans the 100 most common ports || <code class=\"language-plaintext highlighter-rouge\">-p[range]</code> | Specifies a range of port numbers – <code class=\"language-plaintext highlighter-rouge\">-p-</code> scans all the ports || <code class=\"language-plaintext highlighter-rouge\">-Pn</code> | Treat all hosts as online – scan hosts that appear to be down || <strong><em>Service Detection</em></strong> |  || <code class=\"language-plaintext highlighter-rouge\">-O</code> | OS detection || <code class=\"language-plaintext highlighter-rouge\">-sV</code> | Service version detection || <code class=\"language-plaintext highlighter-rouge\">-A</code> | OS detection, version detection, and other additions || <strong><em>Timing</em></strong> |  || <code class=\"language-plaintext highlighter-rouge\">-T&lt;0-5&gt;</code> | Timing template – paranoid (0), sneaky (1), polite (2), normal (3), aggressive (4), and insane (5) || <code class=\"language-plaintext highlighter-rouge\">--min-parallelism &lt;numprobes&gt;</code> and <code class=\"language-plaintext highlighter-rouge\">--max-parallelism &lt;numprobes&gt;</code> | Minimum and maximum number of parallel probes || <code class=\"language-plaintext highlighter-rouge\">--min-rate &lt;number&gt;</code> and <code class=\"language-plaintext highlighter-rouge\">--max-rate &lt;number&gt;</code> | Minimum and maximum rate (packets/second) || <code class=\"language-plaintext highlighter-rouge\">--host-timeout</code> | Maximum amount of time to wait for a target host || <strong><em>Real-time output</em></strong> |  || <code class=\"language-plaintext highlighter-rouge\">-v</code> | Verbosity level – for example, <code class=\"language-plaintext highlighter-rouge\">-vv</code> and <code class=\"language-plaintext highlighter-rouge\">-v4</code> || <code class=\"language-plaintext highlighter-rouge\">-d</code> | Debugging level – for example <code class=\"language-plaintext highlighter-rouge\">-d</code> and <code class=\"language-plaintext highlighter-rouge\">-d9</code> || <strong><em>Report</em></strong> |  || <code class=\"language-plaintext highlighter-rouge\">-oN &lt;filename&gt;</code> | Normal output || <code class=\"language-plaintext highlighter-rouge\">-oX &lt;filename&gt;</code> | XML output || <code class=\"language-plaintext highlighter-rouge\">-oG &lt;filename&gt;</code> | <code class=\"language-plaintext highlighter-rouge\">grep</code>-able output || <code class=\"language-plaintext highlighter-rouge\">-oA &lt;basename&gt;</code> | Output in all major formats |</p><ul>  <li>Completed Nmap The Basics</li>  <li>Completed Cryptography Basics</li></ul><h2 id=\"wrap-up-3\">Wrap Up</h2><p>Another day, another dollar.</p><p>I really feel like these sessions and this framework, specifically sticking to a 15 min warmup and an ending recap are helping.</p><p>From the materials today, even though this is all in my head already I decided to copy paste some of the commands for TCP dump and Nmap, I really enjoyed getting to grips with Wireshark again, I really need to get better at using it and being able to read things in it. perhaps I could spend a day on that or its associated rooms when I get a chance, for now I am sticking with the paths and going off that once I get them hammered out.</p><p>I had to change back to my headset as the AirPods just wouldn’t sit comfortable for me,, could be the fact they are knock offs and the sound is way off…. probably is actually now I think about it, I’ll put them back in the box where I found them and figure out something I can do with them later.</p><p>For now back to my regular post training and exercise life and that means back to house jobs.</p><h2 id=\"06022026\">06/02/2026</h2><h2 id=\"notes\">Notes</h2><p>My Laptop took a shit today.. Cathrine tells me its ‘clearly user error’ so perhaps I am cursed or some shit but these issues with windows are really getting on my nerves.</p><p>I am actually writing this on Saturday (07/02/2026) having got the laptop back into a working state, even windows updates are now correctly installing.</p><p>I considered picking back up THM today and getting that missing 90 minutes focussed learning in but my head isn’t in the game today.. all the hell I went through yesterday (up till 11pm at night) just to get this machine working again really burned me out.</p><p>I am also taking the weekend as rest days on exercise (yeh you try throwing around a kettlebell with an 11 year old in the room) so per my ChatGPT idea.. I rest today and tomorrow and come back strong on Monday.</p><p>I may end up hitting machines on Hack The Box sooner then I think (considered for weeks 9-12) as the rust definitely comes off when you are in that flow state.</p><p>Ill see you next week for the next update post.</p><p>🤙</p><hr /><p>I don’t have any sponsors or anything but if you enjoy my work, or feel sympathy for my wife, then I have set up a <a href=\"https://ko-fi.com/ha3ks\">Ko-Fi account</a> as well as a <a href=\"https://www.buymeacoffee.com/ha3ks\">BuyMeACoffee</a> people can donate to.</p>",
            "url": "https://www.ha3ks.com/weekly-recap/",
            
            
            
            
            
            "date_published": "2026-02-07T00:00:00+00:00",
            "date_modified": "2026-02-07T00:00:00+00:00",
            
                "author": "ha3ks"
            
        },
    
        {
            "id": "https://www.ha3ks.com/the-new-year/",
            "title": "The New Year",
            "summary": null,
            "content_text": "So with the last year now behind us, and no it was not an easy one (all things considered), I look forward to the new things that this year brings us… checks news something something Greenland something something World War 3 probably something something Rising Prices.Ok so maybe this year is also a bad starting point but, here we are now!I have wanted to make more blog posts but honestly finding the time has been complex over the last few weeks but I think I have started to find a rythem to work with.HealthSince last year I have been chipping away at my health, I’ll be 40 (fourty!) this year and as time goes on I can see certain parts of my body failing so I made an active and ongoing decision to focus on health this year.So far I have worked out every day this year laughs in it’s the 19th day of the year and my body is holding up quite well, though let me tell you now, kettlebell swings… at the right mass and speed will, FUCK YOUR LEGS COMPLETELY!!! I had to take it easy yesterday while I got my legs working again. I now know why professional gym goers do certain things on certain days.With that lesson learned I am working on my ‘workout times’ and will switch from mornings to evenings.HackingHacking has been slowing down lately, I haven’t been ‘gettin shellz’ on all the newest things but I have been pushing my learning to actively spend a little bit each day learning something new.In all honesty, it’s all learn no hack while I start to carve my way through the FortiNet 7.6 (NS4) Administrator course, it’s free afterall, and as FortiNet keep getting hacked they will ALWAYS need someone to plug things in and configure them (shhhh).I plan to pick it up as well as NSE 5 ‘satus’ and maybe a cheeky 6/7 (oh god that damn meme) as it may help with future job/pay prospects, as all do we can only hope 😉HomeThings have been going well for the most part, the family is settling into routines and I am getting more and more ‘Dad Card’ stuff done (READ: To Do List).Today for example, as we are decorating the kitchen (half complete) I patched all the cracks and holes in the walls with some Polyfiller and plan tomorrow to sand it smooth and then the follwing day get that base coat of colour down.I fully expect this process to require another can of paint but with the base down we can get an idea of what it would look like completed.I’ve been finding joy in ticking off things; pots, washing, exercise, learn, tablet, read a book.I almost forgot!Least year starting in January I dedicated myself to reading, I wanted to actually read books like everyone else seems to be able to do and I think my problem is that, while I have a gigantic wrinkly brain and semi idetic memory… I can’t do imagination stuff.I would love nothing more than to be able to sit with a hot drink and a copy of The Fellowship of the Ring and start devoring the content, but I can’t.I have no idea why, it should be easy but it just doesn’t work…Now books on a subject or ‘self help/improvement’ that I can absolutely chew through suddenly!Cathrine tells me that they arn’t ‘real books’ and thats ok, they are books for me.Last year I read 8 books and I am going to list them here so you can see how diverse it is:  Honed: Finding Your Edge as a Man Over 40 - Mike Simpson - Don’t tell Mike I was 38 reading it, but it helped me!  Building a Second Brain: A Proven Method to Organise Your Digital Life and Unlock Your Creative Potential - Tiago Forte - I learned how to ‘tag’ and highlight things with this book… I went crazy on it, then back to Honed and then applied it to the next book too (but I was better at it)  Don’t Unplug: How Technology Saved My Life and Can Save Yours Too - Chris Dancy - I tried to read this before via the library and failed, I am glad I came back to this, I love the ‘big mother’ idea (as oppoed to big brother)  Operator Handbook: Red Team + OSINT + Blue Team Reference - Joshua Picolet - I didn’t realise this was a reference book, so since I spent money on it, I read it!!!ebooks  Red Team Development and Operations: A practical guide - Joe Vest, James Tubberville  Visual Threat Intelligence: An Illustrated Guide For Threat - Thomas Roccia  System Failure: Cyberwar on Critical Infrastructure - Chip Harris  Identity and Access Management: from Zero to Hero: Learn all you need about Identity and Access Management (IAM) (Identity in Cybersecurity Book 1) - Maria BryghtOk so it does lean towards the ‘cyber’ bracket but hey, least I am learning!This year I set myself a side challenge to read more (goes hand in hand with working out and eating healthy). I have already made it through some of my new list/pile - google ‘PocketBook’ and get an account, download the app and read on your phone. It is actually working for me and it might help you too! Additionally you can dump .epub books in it as well as .pdfs …For any curious, I finished the ebook version of The Unfair Advantage: How You Already Have What It Takes to Succeed  - Ash Ali &amp; Hasan Kubba AND ALSO my audiobook copy of Permanent Record: A Memoir of a Reluctant Whistleblower - Edward Snowden all by the 16th.Turns out a chapter per day is ‘doable’ and audiobooks are just a ‘when doing something’ listening so suprisingly easy to get on with, walking, odd jobs, headphones in and audiobook playing.Thats two so far and we are 19 days into the year… my current read is The Glass Ledge: How to Break Through Self-Sabotage, Embrace Your Power, and Create Your Success - Iman Oubou and the Audiobook version of 12 Rules for Life: An Antidote to Chaos - Jordan B. Peterson – fuck it’s a long one, currently 7 hours left mind.I have my next ones lined up too so heres to doing adult things, like reading!And that about concludes my update for so far this year. I am hopeful I can add more here but I am actively doing A LOT(!) in the background.I really want to get the sensory room/office up and running soon so I have a little bit of space to work (and remote work ideally) and restore the living room to being the chill space it should be.Here’s to 2026 so far!I don’t have any sponsors or anything but if you enjoy my work, or feel sympathy for my wife, then I have set up a Ko-Fi account as well as a BuyMeACoffee people can donate to.",
            "content_html": "<p>So with the last year now behind us, and no it was not an easy one (all things considered), I look forward to the new things that this year brings us… <em>checks news</em> something something Greenland something something World War 3 probably something something Rising Prices.</p><p>Ok so maybe this year is also a bad starting point but, here we are now!</p><p>I have wanted to make more blog posts but honestly finding the time has been complex over the last few weeks but I think I have started to find a rythem to work with.</p><h1 id=\"health\">Health</h1><p>Since last year I have been chipping away at my health, I’ll be 40 (fourty!) this year and as time goes on I can see certain parts of my body failing so I made an active and ongoing decision to focus on health this year.</p><p>So far I have worked out every day this year <em>laughs in it’s the 19th day of the year</em> and my body is holding up quite well, though let me tell you now, kettlebell swings… at the right mass and speed will, FUCK YOUR LEGS COMPLETELY!!! I had to take it easy yesterday while I got my legs working again. I now know why professional gym goers do certain things on certain days.</p><p>With that lesson learned I am working on my ‘workout times’ and will switch from mornings to evenings.</p><h1 id=\"hacking\">Hacking</h1><p>Hacking has been slowing down lately, I haven’t been ‘gettin shellz’ on all the newest things but I have been pushing my learning to actively spend a little bit each day learning something new.</p><p>In all honesty, it’s all learn no hack while I start to carve my way through the FortiNet 7.6 (NS4) Administrator course, it’s free afterall, and as FortiNet keep getting hacked they will ALWAYS need someone to plug things in and configure them (shhhh).</p><p>I plan to pick it up as well as NSE 5 ‘satus’ and maybe a cheeky 6/7 (oh god that damn meme) as it may help with future job/pay prospects, as all do we can only hope 😉</p><h1 id=\"home\">Home</h1><p>Things have been going well for the most part, the family is settling into routines and I am getting more and more ‘Dad Card’ stuff done (READ: To Do List).</p><p>Today for example, as we are decorating the kitchen (half complete) I patched all the cracks and holes in the walls with some Polyfiller and plan tomorrow to sand it smooth and then the follwing day get that base coat of colour down.</p><p>I fully expect this process to require another can of paint but with the base down we can get an idea of what it would look like completed.</p><p>I’ve been finding joy in ticking off things; pots, washing, exercise, learn, tablet, read a book.</p><p>I almost forgot!</p><p>Least year starting in January I dedicated myself to reading, I wanted to actually read books like everyone else seems to be able to do and I think my problem is that, while I have a gigantic wrinkly brain and semi idetic memory… I can’t do imagination stuff.</p><p>I would love nothing more than to be able to sit with a hot drink and a copy of The Fellowship of the Ring and start devoring the content, but I can’t.</p><p>I have no idea why, it should be easy but it just doesn’t work…</p><p>Now books on a subject or ‘self help/improvement’ that I can absolutely chew through suddenly!</p><p>Cathrine tells me that they arn’t ‘real books’ and thats ok, they are books for me.</p><p>Last year I read 8 books and I am going to list them here so you can see how diverse it is:</p><ul>  <li><a href=\"https://amzn.eu/d/3g2aK8n\">Honed: Finding Your Edge as a Man Over 40</a> - Mike Simpson - Don’t tell Mike I was 38 reading it, but it helped me!</li>  <li><a href=\"\">Building a Second Brain: A Proven Method to Organise Your Digital Life and Unlock Your Creative Potential</a> - Tiago Forte - I learned how to ‘tag’ and highlight things with this book… I went crazy on it, then back to Honed and then applied it to the next book too (but I was better at it)</li>  <li><a href=\"https://amzn.eu/d/a14iIos\">Don’t Unplug: How Technology Saved My Life and Can Save Yours Too</a> - Chris Dancy - I tried to read this before via the library and failed, I am glad I came back to this, I love the ‘big mother’ idea (as oppoed to big brother)</li>  <li><a href=\"https://amzn.eu/d/aYtZWa3\">Operator Handbook: Red Team + OSINT + Blue Team Reference</a> - Joshua Picolet - I didn’t realise this was a reference book, so since I spent money on it, I read it!!!</li></ul><p>ebooks</p><ul>  <li><a href=\"https://amzn.eu/d/7fI6Rcr\">Red Team Development and Operations: A practical guide</a> - Joe Vest, James Tubberville</li>  <li><a href=\"https://amzn.eu/d/49AyEhw\">Visual Threat Intelligence: An Illustrated Guide For Threat</a> - Thomas Roccia</li>  <li><a href=\"https://amzn.eu/d/hqDEOAl\">System Failure: Cyberwar on Critical Infrastructure</a> - Chip Harris</li>  <li><a href=\"https://amzn.eu/d/9xJQFHP\">Identity and Access Management: from Zero to Hero: Learn all you need about Identity and Access Management (IAM) (Identity in Cybersecurity Book 1)</a> - Maria Bryght</li></ul><p>Ok so it does lean towards the ‘cyber’ bracket but hey, least I am learning!</p><p>This year I set myself a side challenge to read more (goes hand in hand with working out and eating healthy). I have already made it through some of my new list/pile - google ‘PocketBook’ and get an account, download the app and read on your phone. It is actually working for me and it might help you too! Additionally you can dump .epub books in it as well as .pdfs …</p><p>For any curious, I finished the ebook version of <a href=\"https://amzn.eu/d/3HGfRjp\">The Unfair Advantage: How You Already Have What It Takes to Succeed </a> - Ash Ali &amp; Hasan Kubba AND ALSO my audiobook copy of <a href=\"https://amzn.eu/d/3CbADm4\">Permanent Record: A Memoir of a Reluctant Whistleblower</a> - Edward Snowden all by the 16th.</p><p>Turns out a chapter per day is ‘doable’ and audiobooks are just a ‘when doing something’ listening so suprisingly easy to get on with, walking, odd jobs, headphones in and audiobook playing.</p><p>Thats two so far and we are 19 days into the year… my current read is <a href=\"https://amzn.eu/d/j5ctufD\">The Glass Ledge: How to Break Through Self-Sabotage, Embrace Your Power, and Create Your Success</a> - Iman Oubou and the Audiobook version of <a href=\"https://amzn.eu/d/cSdbb84\">12 Rules for Life: An Antidote to Chaos</a> - Jordan B. Peterson – fuck it’s a long one, currently 7 hours left mind.</p><p>I have my next ones lined up too so heres to doing adult things, like reading!</p><hr /><p>And that about concludes my update for so far this year. I am hopeful I can add more here but I am actively doing A LOT(!) in the background.</p><p>I really want to get the sensory room/office up and running soon so I have a little bit of space to work (and remote work ideally) and restore the living room to being the chill space it should be.</p><p>Here’s to 2026 so far!</p><hr /><p>I don’t have any sponsors or anything but if you enjoy my work, or feel sympathy for my wife, then I have set up a <a href=\"https://ko-fi.com/ha3ks\">Ko-Fi account</a> as well as a <a href=\"https://www.buymeacoffee.com/ha3ks\">BuyMeACoffee</a> people can donate to.</p>",
            "url": "https://www.ha3ks.com/the-new-year/",
            
            
            
            
            
            "date_published": "2026-01-19T00:00:00+00:00",
            "date_modified": "2026-01-19T00:00:00+00:00",
            
                "author": "ha3ks"
            
        },
    
        {
            "id": "https://www.ha3ks.com/on-data-loss/",
            "title": "On Data Loss",
            "summary": null,
            "content_text": "I lost data the other day. I’m pretty bummed out about it. I lost all my entire ‘Documents’ folder. Here’s the worst part… I truly in my heart of hearts don’t know how it happened. It’s one thing to make a mistake, hell I make them ALL the time. But it’s another to have something bad happen, play it back in your head and not know WHY it happened.I like to pride myself on having a pretty spotless data loss record. For the last maybe 15 years or a little more I have NEVER lost files. Hellova record.I am a firm beleiver in the 3-2-1 backup method, it’s well known and well respected, near everyone I have looked up to over the years has used some variant of this method, the gist of which is summed up as ‘3 copies of your data, 2 different types of media (say HDD and cloud) and 1 copy stored elsewhere’ the idea being that if your house burned down tomorrow, you would still have everything you need stored in some other location.I have thrown away data over the years but I’m talking linux iso’s burned to disks that I no longer needed, things like that, infact this was probably 7 years ago that I chucked them as my laptop at the time (and everyone since) hasn’t had a CD/DVD drive in it yay technology(?)This stung though, I had roughly 46Gb of data in my Documents folder, I initially thought it was 35GB but realised I had a ‘data management’ day and moved my old blog archives and old posts in there as well.So OFFICIALLY speaking, this blog and its post’s are the entirety of the words, stories, knowledge and teaching I have written over the years.My stomach still hurts just thinking about it.I actually figured it out, the loss included;  Blog posts  CTF notes/cheatsheets  Fully written CTF writeups ready to be released daily for about 4 months (I wrote A LOT)  Personal documents  CVs I have made over the years (always have your CV up to date) - Downloaded a backup  Medical Documents  Books - Legal ones not torrented stuff  Business Ideas/Notes/Paperwork/Intellectual Property  Archives of my old Google Account/Drive  a BIG folder of stuff to be sorted  Applications I have developed  A Journal  Mods for games I have played over the years  My ENTIRE PEN200.rar download from Offsec (all the training material for my OSCP attampt) - F**K!!And I think that about covers it…Honestly it hurts and I don’t think I’ll get over it anytime soon BUT it is nice to get it off my chest (so to speak).It was my error, I guess, I just don’t know how it happened.Of the things I can speak about… I was between backup solutions, moving stuff from one provider to another in a futureproofing effort, I was trying to make my life easier going forwards but as it turns out, you copy this, move that and try to put it back (or something) and somehow you have an empty folder copy over the full one and poof it’s gone.Lé Sigh..For the nerds reading this, yes I too am a nerd.Infact I am the Cheif ‘Household IT Guru’ for our house, and I did try some data recovery solutions.For people unfamiliar with the deletion process, when you delete an item on your computer is isn’t actually gone what happens is the link to the item you see in your documents folder or desktop is simply removed, so you no longer ‘see’ the file and it goes to the recycle bin.The same thing happens when you empty the recycle bin (to a degree based on overall file size) the link to that file is removed, not the file itself which sits ‘unmapped’ somewhere on your hard drive, so nothing can ‘find’ it.As the IT Guru I tried several free and probably malware laiden solutions from websites some would consider ‘highly sketchy’. Of the softwares used only 2 had some success finding some of the files and of the two one got the file names and sizes correct, the other recovered some .txt files but they were filled with unintelligble garbage… lost and shredded it seems.Again, this hurts, I’m still wating for Offsec to come back to me on what can be done about my super old training material from 2021 before everything changed and still included the Buffer Overflow stuff - Damn Offsec sure has changed over the years, did you know they now give you creds for the Active Directory set (well low priv and you have to figure out the rest).Moving forwardWell it’s not all doom and gloom, Im happy that I have been able to ‘find’ some of the things I am missing, Humble Bundle keeps copies of your purchased content so ‘hello’ 1/5th of the books I used to have.My backup and recovery method works for everything but my documents folder apparently (I laugh about it now but know there are some tears at the corners of my eyes).I don’t see something like this ever happening again but I will be double checking files and sizes before anything and hopefully in the future be getting a little NAS set up for me and the family, you would be suprised what kinds of ‘fun things’ you can find on eBay cheap enough.I don’t think it’s likely but if any cool storage providers out there want to reach out and sponsor the ‘Ha3ks HomeLab’ I am completely open, email me! 😂I don’t have any sponsors or anything but if you enjoy my work, or feel sympathy for my wife, then I have set up a Ko-Fi account as well as a BuyMeACoffee people can donate to.",
            "content_html": "<p><img src=\"/assets/blog/On-Data-Loss/1.avif\" alt=\"1\" class=\"align-center\" /></p><p>I lost data the other day. I’m pretty bummed out about it. I lost all my entire ‘Documents’ folder. Here’s the worst part… I truly in my heart of hearts don’t know how it happened. It’s one thing to make a mistake, hell I make them ALL the time. But it’s another to have something bad happen, play it back in your head and not know WHY it happened.</p><p>I like to pride myself on having a pretty spotless data loss record. For the last maybe 15 years or a little more I have NEVER lost files. Hellova record.</p><p>I am a firm beleiver in the <a href=\"https://www.veeam.com/blog/321-backup-rule.html\">3-2-1 backup method</a>, it’s well known and well respected, near everyone I have looked up to over the years has used some variant of this method, the gist of which is summed up as ‘3 copies of your data, 2 different types of media (say HDD and cloud) and 1 copy stored elsewhere’ the idea being that if your house burned down tomorrow, you would still have everything you need stored in some other location.</p><p>I have thrown away data over the years but I’m talking linux iso’s burned to disks that I no longer needed, things like that, infact this was probably 7 years ago that I chucked them as my laptop at the time (and everyone since) hasn’t had a CD/DVD drive in it <em>yay technology(?)</em></p><p>This stung though, I had roughly 46Gb of data in my Documents folder, I initially thought it was 35GB but realised I had a ‘data management’ day and moved my old blog archives and old posts in there as well.</p><p>So OFFICIALLY speaking, this blog and its post’s are the entirety of the words, stories, knowledge and teaching I have written over the years.</p><p>My stomach still hurts just thinking about it.</p><p>I actually figured it out, the loss included;</p><ul>  <li>Blog posts</li>  <li>CTF notes/cheatsheets</li>  <li>Fully written CTF writeups ready to be released daily for about 4 months (I wrote A LOT)</li>  <li>Personal documents</li>  <li>CVs I have made over the years (always have your CV up to date) - Downloaded a backup</li>  <li>Medical Documents</li>  <li>Books - Legal ones not torrented stuff</li>  <li>Business Ideas/Notes/Paperwork/Intellectual Property</li>  <li>Archives of my old Google Account/Drive</li>  <li>a BIG folder of stuff to be sorted</li>  <li>Applications I have developed</li>  <li>A Journal</li>  <li>Mods for games I have played over the years</li>  <li>My ENTIRE PEN200.rar download from Offsec (all the training material for my OSCP attampt) - F**K!!</li></ul><p>And I think that about covers it…</p><p>Honestly it hurts and I don’t think I’ll get over it anytime soon BUT it is nice to get it off my chest (so to speak).</p><p>It was my error, I guess, I just don’t know how it happened.</p><p>Of the things I can speak about… I was between backup solutions, moving stuff from one provider to another in a futureproofing effort, I was trying to make my life easier going forwards but as it turns out, you copy this, move that and try to put it back (or something) and somehow you have an empty folder copy over the full one and <em>poof</em> it’s gone.</p><h2 id=\"lé-sigh\">Lé Sigh..</h2><p>For the nerds reading this, yes I too am a nerd.</p><p>Infact I am the Cheif ‘Household IT Guru’ for our house, and I did try some data recovery solutions.</p><p>For people unfamiliar with the deletion process, when you delete an item on your computer is isn’t actually <em>gone</em> what happens is the link to the item you see in your documents folder or desktop is simply removed, so you no longer ‘see’ the file and it goes to the recycle bin.</p><p>The same thing happens when you empty the recycle bin (to a degree based on overall file size) the link to that file is removed, not the file itself which sits ‘unmapped’ somewhere on your hard drive, so nothing can ‘find’ it.</p><p>As the IT Guru I tried several free and probably malware laiden solutions from websites some would consider ‘highly sketchy’. Of the softwares used only 2 had some success finding some of the files and of the two one got the file names and sizes correct, the other recovered some .txt files but they were filled with unintelligble garbage… lost and shredded it seems.</p><p>Again, this hurts, I’m still wating for Offsec to come back to me on what can be done about my <em>super old</em> training material from 2021 before everything changed and still included the Buffer Overflow stuff - Damn Offsec sure has changed over the years, did you know they now give you creds for the Active Directory set (well low priv and you have to figure out the rest).</p><h2 id=\"moving-forward\">Moving forward</h2><p>Well it’s not all doom and gloom, Im happy that I have been able to ‘find’ some of the things I am missing, Humble Bundle keeps copies of your purchased content so ‘hello’ 1/5th of the books I used to have.</p><p>My backup and recovery method works for everything but my documents folder apparently (I laugh about it now but know there are some tears at the corners of my eyes).</p><p>I don’t see something like this ever happening again but I will be double checking files and sizes before anything and <em>hopefully</em> in the future be getting a little NAS set up for me and the family, you would be suprised what kinds of ‘fun things’ you can find on eBay cheap enough.</p><p>I don’t think it’s likely but if any cool storage providers out there want to reach out and sponsor the ‘Ha3ks HomeLab’ I am completely open, email me! 😂</p><hr /><p>I don’t have any sponsors or anything but if you enjoy my work, or feel sympathy for my wife, then I have set up a <a href=\"https://ko-fi.com/ha3ks\">Ko-Fi account</a> as well as a <a href=\"https://www.buymeacoffee.com/ha3ks\">BuyMeACoffee</a> people can donate to.</p>",
            "url": "https://www.ha3ks.com/on-data-loss/",
            
            
            
            
            
            "date_published": "2025-12-05T00:00:00+00:00",
            "date_modified": "2025-12-05T00:00:00+00:00",
            
                "author": "ha3ks"
            
        },
    
        {
            "id": "https://www.ha3ks.com/kubernetes-from-someone-who-has-12-whole-hours-experience/",
            "title": "Kubernetes - from someone who has 12 whole hours experience",
            "summary": null,
            "content_text": "The other day I while having one of my usual mid career crisis’ moments I recalled that I wanted to know more about Kubernetes.It’s a niche topic, companies are paying top dollar for people who know how to use it so I figured I would invest an hour or two of my time nailing down some of the basics.A slight spoiler for this is I already have ‘some’ experience with Kubernetes, not much, but I am familiar with some commands and interactions.So I wrote down short list:  How do I set up a multi node cluster?  How do I run a web app on Kubernetes?  Extra Mile: Can I run AI on it?It was at this moment the YouTube algorithm gods pushed me a recommendation and I couldn’t turn it down.  He was a nurse that pivoted into DevOps and is helping others along the way, awesome.This video served as a guide on getting a simple web app up and rolling so I figured I would try to replicate it.“But Dan(?)” you ask, “You don’t has any Raspberry Pi’s to hand and your laptop has a hardware fault that nukes the OS every few days, how are you going to do that”Quickly dear reader.The answer is, very quickly.Initial issues building VMsIn the process of trying this the laptop folded in on itself and I lost my VMs… Trivial, but a setback non the less.I settled on Ubuntu server as I can happily run it headless (so no GUI) and they can siphon off very little computing power to get rolling.One thing I did learn when provisioning machines is ‘dont just set them to 1 CPU and 1GB RAM’ right off the bat, otherwise you will run into errors like this:Yeh, that was my fault.It took me longer then I am willing to admit, but that was the issue so I gave the VM(s) 2 CPU and 4GB of RAM that I could later tone down but, actually, I just left it and let it roll which seemes to have worked out for the better.Make sure your ‘Host’ machine or ‘Homelab Sever’ is ALWAYS big and beefy - go into debt if you have to. (This is a meme moment, please don’t go into debt)Once one machine was up and running and aptly named ‘kb1’ I set up ‘kb2’ and ‘kb3’ making a 3 node cluster.Configuration of VMs Now using my big wrinkly brain and the Youtube video above I was able to configure ‘kb1’ as the controller and then ‘kb2’ and ‘kb3’ would be nodes that connect to ‘kb1’.The setup process was suprisingly easy, as per the video (and in this case I am using K3s) go to k3s.io/ and you can run the quickstart that is literally in the banner up top:curl -sfL https://get.k3s.io | sh - This will get your initial controller up and going, if you are a nerd like me and during the setup of Ubuntu server you enabled SSH (but didn’t add a key because YOLO) you can SSH into your ‘kb1’ and run the command which will install everything. Make sure your hostname on your main controller matches:dm@kb-01:~$ hostnamekb-01Once one is up and running, getting the others going is relatively straightforwards you just need to check the documentation (quick start guide) for setting up a node;The command being:curl -sfL https://get.k3s.io | K3S_URL=https://myserver:6443 K3S_TOKEN=mynodetoken sh -Now there are some important changes, obviously, it is doing the same curl to grab the files from k3s.io BUT it is going to get the configuration file from your local ‘kb1’ (default server port is 6443) as such you need to enter the ip address for that machine as well as grabbing your K3S token from that machine.Handily the code to output the token file is:cat /var/lib/rancher/k3s/server/node-tokenIn my case the outout wasdm@kb-01:~$ cat /var/lib/rancher/k3s/server/node-tokenK104cc460e12aff973b5a7d17aa85c8e54614093193bafbde946c44aad567b81ea8::server:2228d1bb88e07aa59f637bbd34f1b4a5So, alltogether on each of my nodes you would be running:curl -sfL https://get.k3s.io | K3S_URL=https://192.168.4.131:6443 K3S_TOKEN=K104cc460e12aff973b5a7d17aa85c8e54614093193bafbde946c44aad567b81ea8::server:2228d1bb88e07aa59f637bbd34f1b4a5 sh -Which downloads the files from the web, gets the configuration from your local control-pane or master ‘kb1’ and bippity boppity you have 2 nodes connecting to your master.Now you can ssh into ‘kb1’ again and see them running with the get nodes command as per below:dm@kb-01:~$ kubectl get nodesNAME    STATUS   ROLES                  AGE    VERSIONkb-01   Ready    control-plane,master   4d7h   v1.33.5+k3s1kb-02   Ready    &lt;none&gt;                 4d7h   v1.33.5+k3s1kb-03   Ready    &lt;none&gt;                 4d7h   v1.33.5+k3s1Now that we have our cluster, we need to put it to work.A Fist Fight with YAMLFor those who don’t know Kubernetes uses YAML files for its sets of instructions, YAML stands for Yet Another Markup Language.I would be following the video to the letter to get a nice little web app up and running so I was going to be installing LinkDingLinkDing is a bookmark manager that you can run on your Self Host and synchronise bookmarks between browsers and devices… pretty neat.Accordingly I paused the video and copied the code, word for word… or so I thought.I am going to paste my origional note here so you can see what happened:apiVersion: v1kind: Namespacemetadata: name: linkding---apiVersion: apps/v1kind: Deploymentmetadata: name: linkding namespace: linkdingspec: replicas: 1 selector:  matchLabels:   app: linkding template:  metadata:   labels:    app: linkding  spec:   contaiters:   - name: linkding     image: sissbruecker/linkding:1.44.1     ports:     - containerPort: 9090Yeh, you can see it can’t you, damn experts…When runing the code initially I was met with a confusing amount of various errors:  “Unknown field in spec.template.spec.contaiters”  “error converting YAML to JSON: YAML: line blah blah blah”  “Mapping values not allowed in this context”I made subtle tweaks and changes to the code, resulting in different errors, many visits to Stack Overflow, Google and other search engines with half baked in AI.I elected to not actually use AI in this project, partly due to the challenge of actually debugging and fixing the problem and partly because, if you havent noticed YOU are the training data that AI is using, everything you enter is recorded and logged and never deleted unless you take the time to jump through the hoops and actually find the option to permanently remove your data… Dont make the ‘systems’ job easier by feeding it everything about you and what you want.If I had the cash and the ability I would absolutely do a PewDiePie and set up a Self Host and do it all locally:  Lo, I am not rich and My laptop dies often as we all know so back to itFlipping the tableAfter a few hours, like literally two hours, I decided to give up for now, I had done everything I can think of to get this thing up and running and it just was not budging, I had even used an online YAML checker as part of debugging which is why the error kept changing and that was coming back green saying ‘yeh this is valid YAML my dude’ so I decided to power off the cluster. Gather my thoughts on my notepad and take a break.I had planned to do something that day and ended up getting it hammered out, watched some TV and played some games as a distraction.Honestly that Game Pass Ultimate at £14.99 a month is a god send, though now it’s going to be £22.99 a month I really have to decide if it’s worth keeping or not, probably will mind.Coming back fresh headAfter the rest of that day of ‘relaxing’ I thought it might be fun to play on the laptop a moment, so I opened up ‘ol faithful and staring at me was the notepad…There is was, staring me in the face like the end of ‘The Usual Suspects’:A SPELLING MISTAKEA SPELLING MISTAKE COST ME 3 HOURS OF DEBUGGINGThe Rage at myself, and spellcheck, was able to be measured in that momentGah!So, presenting the correct dep.yaml I made:apiVersion: v1kind: Namespacemetadata: name: linkding---apiVersion: apps/v1kind: Deploymentmetadata: name: linkding namespace: linkdingspec: replicas: 1 selector:  matchLabels:   app: linkding template:  metadata:   labels:    app: linkding  spec:   containers: # Yes the edit was here...   - name: linkding     image: sissbruecker/linkding:1.44.1     ports:     - containerPort: 9090Then I ran sudo kubectl apply -f dep.yaml which would install and configure the app based on the yaml input..Build complete..It actaully did it!Happy Dance moment if you please!Now not to get too carried away you can check and make sure it is running by entering:dm@kb-01:~$ kubectl get podsNo resources found in default namespace.Shit.It was at this moment that my debugging came back to mind, search for the answer and you WILL find it, lo and behold I can add --all-namespace and see everything running:dm@kb-01:~$ kubectl get pods --all-namespacesNAMESPACE     NAME                                      READY   STATUS      RESTARTS      AGEkube-system   coredns-64fd4b4794-zf2dp                  1/1     Running     2 (41m ago)   4d8hkube-system   helm-install-traefik-4jxdl                0/1     Completed   2             4d8hkube-system   helm-install-traefik-crd-fqfr7            0/1     Completed   0             4d8hkube-system   local-path-provisioner-774c6665dc-qk9kl   1/1     Running     2 (41m ago)   4d8hkube-system   metrics-server-7bfffcd44-pd2rs            1/1     Running     2 (41m ago)   4d8hkube-system   svclb-traefik-c8216a6a-29ntq              2/2     Running     4 (41m ago)   4d8hkube-system   svclb-traefik-c8216a6a-8ttrg              2/2     Running     4 (39m ago)   4d8hkube-system   svclb-traefik-c8216a6a-xggvm              2/2     Running     4 (40m ago)   4d8hkube-system   traefik-c98fdf6fb-gtv4k                   1/1     Running     2 (41m ago)   4d8hlinkding      linkding-7d4c6f6dbb-nrk9c                 1/1     Running     1 (39m ago)   3d19hAh that’s better and look linkding is up and rolling, now we’re cooking on gas.Now remember that name linkding-7d4c6f6dbb-nrk9c because we are going to need that.Port FowardingNow we have a working and live webapp running, we need to be able to access it, turns out you can’t just type in the IP address to your browser and it will suddenly take you there, you need to set up a portforward so you can log into it and access it.This process is relatively straight forward if you have a basic understanding of port forwarding so I will drop the commend I used:kubectl port-forward pod/linkding-7d4c6f6dbb-nrk9c 9090:9090So we are telling Kubectl (control) to set up a port forward of this particular app or pod and the name of it to a certain port we can access in this case 9090.Running it gives little in the way of output as it is in a ‘running’ state, but when you try browsing to it then it will start to fill with logging:And just like that, we have a successful self host!I have had some time to play with this and generally, I love it.I can’t wait for future me to have money so that I can invest in some Self Host Loving and get a little server up and running with our Plex needs, networking labs, pentesting labs, Kubernetes Clusters and other things.Honestly I would be happy with 3 Raspberry Pis and a simple NAS, I can assure you I would have headroom have network wide Ad Blocking and be able to entertain my family.If you haven’t considered it before.. look into it. If my haggared laptop can survive long enough to not only do this lab but also survive the write up, you can do it too and learn something.I didn’t quite get to scratch that Ai ‘extra mile’ off the list, but it is on the cards. It’s nice to have ‘project work’ in the background, I also have some certs to be studying for.. will see what happens with them.Be safe all and I’ll see you in the next post.🤙I don’t have any sponsors or anything but if you enjoy my work, or feel sympathy for my wife, then I have set up a Ko-Fi account as well as a BuyMeACoffee people can donate to.",
            "content_html": "<p>The other day I while having one of my usual mid career crisis’ moments I recalled that I wanted to know more about Kubernetes.</p><p><img src=\"/assets/blog/Kubernetes-12-hours/1.gif\" alt=\"1\" class=\"align-center\" /></p><p>It’s a niche topic, companies are paying top dollar for people who know how to use it so I figured I would invest an hour or two of my time nailing down some of the basics.</p><p>A slight spoiler for this is I already have ‘some’ experience with Kubernetes, not much, but I am familiar with some commands and interactions.</p><p>So I wrote down short list:</p><ul>  <li>How do I set up a multi node cluster?</li>  <li>How do I run a web app on Kubernetes?</li>  <li>Extra Mile: Can I run AI on it?</li></ul><p>It was at this moment the YouTube algorithm gods pushed me a recommendation and I couldn’t turn it down.</p><div style=\"text-align: center; margin: 2rem 0;\">  <iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/NkM6wQL2UvM\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\" style=\"max-width: 100%;\"></iframe></div><p>He was a nurse that pivoted into DevOps and is helping others along the way, awesome.</p><p>This video served as a guide on getting a simple web app up and rolling so I figured I would try to replicate it.</p><p>“But Dan(?)” you ask, “You don’t has any Raspberry Pi’s to hand and your laptop has a hardware fault that nukes the OS every few days, how are you going to do that”</p><p>Quickly dear reader.</p><p>The answer is, <u>very</u> quickly.</p><h2 id=\"initial-issues-building-vms\">Initial issues building VMs</h2><p>In the process of trying this the laptop folded in on itself and I lost my VMs… Trivial, but a setback non the less.</p><p>I settled on Ubuntu server as I can happily run it headless (so no GUI) and they can siphon off very little computing power to get rolling.</p><p>One thing I did learn when provisioning machines is ‘dont just set them to 1 CPU and 1GB RAM’ right off the bat, otherwise you will run into errors like this:</p><hr /><p><img src=\"/assets/blog/Kubernetes-12-hours/2.png\" class=\"align-left\" /></p><p>Yeh, that was my fault.</p><p>It took me longer then I am willing to admit, but that was the issue so I gave the VM(s) 2 CPU and 4GB of RAM that I could later tone down but, actually, I just left it and let it roll which seemes to have worked out for the better.</p><p>Make sure your ‘Host’ machine or ‘Homelab Sever’ is ALWAYS big and beefy - go into debt if you have to. (This is a meme moment, please don’t go into debt)</p><p>Once one machine was up and running and aptly named ‘kb1’ I set up ‘kb2’ and ‘kb3’ making a 3 node cluster.</p><h2 id=\"configuration-of-vms\">Configuration of VMs </h2><p>Now using my big wrinkly brain and the Youtube video above I was able to configure ‘kb1’ as the controller and then ‘kb2’ and ‘kb3’ would be nodes that connect to ‘kb1’.</p><p>The setup process was suprisingly easy, as per the video (and in this case I am using K3s) go to <a href=\"https://k3s.io/\">k3s.io/</a> and you can run the quickstart that is literally in the banner up top:</p><p><img src=\"/assets/blog/Kubernetes-12-hours/3.png\" alt=\"3\" class=\"align-center\" /></p><div class=\"language-plaintext highlighter-rouge\"><div class=\"highlight\"><pre class=\"highlight\"><code>curl -sfL https://get.k3s.io | sh - </code></pre></div></div><p>This will get your initial controller up and going, if you are a nerd like me and during the setup of Ubuntu server you enabled SSH (but didn’t add a key because YOLO) you can SSH into your ‘kb1’ and run the command which will install everything. Make sure your hostname on your main controller matches:</p><div class=\"language-plaintext highlighter-rouge\"><div class=\"highlight\"><pre class=\"highlight\"><code>dm@kb-01:~$ hostnamekb-01</code></pre></div></div><p>Once one is up and running, getting the others going is relatively straightforwards you just need to check the documentation (quick start guide) for setting up a node;</p><p><img src=\"/assets/blog/Kubernetes-12-hours/4.png\" alt=\"4\" class=\"align-center\" /></p><p>The command being:</p><div class=\"language-plaintext highlighter-rouge\"><div class=\"highlight\"><pre class=\"highlight\"><code>curl -sfL https://get.k3s.io | K3S_URL=https://myserver:6443 K3S_TOKEN=mynodetoken sh -</code></pre></div></div><p>Now there are some important changes, obviously, it is doing the same curl to grab the files from k3s.io BUT it is going to get the configuration file from your local ‘kb1’ (default server port is 6443) as such you need to enter the ip address for that machine as well as grabbing your K3S token from that machine.</p><p>Handily the code to output the token file is:</p><div class=\"language-plaintext highlighter-rouge\"><div class=\"highlight\"><pre class=\"highlight\"><code>cat /var/lib/rancher/k3s/server/node-token</code></pre></div></div><p>In my case the outout was</p><div class=\"language-plaintext highlighter-rouge\"><div class=\"highlight\"><pre class=\"highlight\"><code>dm@kb-01:~$ cat /var/lib/rancher/k3s/server/node-tokenK104cc460e12aff973b5a7d17aa85c8e54614093193bafbde946c44aad567b81ea8::server:2228d1bb88e07aa59f637bbd34f1b4a5</code></pre></div></div><p>So, alltogether on each of my nodes you would be running:</p><div class=\"language-plaintext highlighter-rouge\"><div class=\"highlight\"><pre class=\"highlight\"><code>curl -sfL https://get.k3s.io | K3S_URL=https://192.168.4.131:6443 K3S_TOKEN=K104cc460e12aff973b5a7d17aa85c8e54614093193bafbde946c44aad567b81ea8::server:2228d1bb88e07aa59f637bbd34f1b4a5 sh -</code></pre></div></div><p>Which downloads the files from the web, gets the configuration from your local control-pane or master ‘kb1’ and bippity boppity you have 2 nodes connecting to your master.</p><p>Now you can ssh into ‘kb1’ again and see them running with the <code class=\"language-plaintext highlighter-rouge\">get nodes</code> command as per below:</p><div class=\"language-plaintext highlighter-rouge\"><div class=\"highlight\"><pre class=\"highlight\"><code>dm@kb-01:~$ kubectl get nodesNAME    STATUS   ROLES                  AGE    VERSIONkb-01   Ready    control-plane,master   4d7h   v1.33.5+k3s1kb-02   Ready    &lt;none&gt;                 4d7h   v1.33.5+k3s1kb-03   Ready    &lt;none&gt;                 4d7h   v1.33.5+k3s1</code></pre></div></div><p>Now that we have our cluster, we need to put it to work.</p><h2 id=\"a-fist-fight-with-yaml\">A Fist Fight with YAML</h2><p>For those who don’t know Kubernetes uses YAML files for its sets of instructions, YAML stands for Yet Another Markup Language.</p><p>I would be following the video to the letter to get a nice little web app up and running so I was going to be installing <a href=\"https://linkding.link/\">LinkDing</a></p><p>LinkDing is a bookmark manager that you can run on your Self Host and synchronise bookmarks between browsers and devices… pretty neat.</p><p>Accordingly I paused the video and copied the code, word for word… or so I thought.</p><p>I am going to paste my origional note here so you can see what happened:</p><div class=\"language-yaml highlighter-rouge\"><div class=\"highlight\"><pre class=\"highlight\"><code><span class=\"na\">apiVersion</span><span class=\"pi\">:</span> <span class=\"s\">v1</span><span class=\"na\">kind</span><span class=\"pi\">:</span> <span class=\"s\">Namespace</span><span class=\"na\">metadata</span><span class=\"pi\">:</span> <span class=\"na\">name</span><span class=\"pi\">:</span> <span class=\"s\">linkding</span><span class=\"nn\">---</span><span class=\"na\">apiVersion</span><span class=\"pi\">:</span> <span class=\"s\">apps/v1</span><span class=\"na\">kind</span><span class=\"pi\">:</span> <span class=\"s\">Deployment</span><span class=\"na\">metadata</span><span class=\"pi\">:</span> <span class=\"na\">name</span><span class=\"pi\">:</span> <span class=\"s\">linkding</span> <span class=\"na\">namespace</span><span class=\"pi\">:</span> <span class=\"s\">linkding</span><span class=\"na\">spec</span><span class=\"pi\">:</span> <span class=\"na\">replicas</span><span class=\"pi\">:</span> <span class=\"m\">1</span> <span class=\"na\">selector</span><span class=\"pi\">:</span>  <span class=\"na\">matchLabels</span><span class=\"pi\">:</span>   <span class=\"na\">app</span><span class=\"pi\">:</span> <span class=\"s\">linkding</span> <span class=\"na\">template</span><span class=\"pi\">:</span>  <span class=\"na\">metadata</span><span class=\"pi\">:</span>   <span class=\"na\">labels</span><span class=\"pi\">:</span>    <span class=\"na\">app</span><span class=\"pi\">:</span> <span class=\"s\">linkding</span>  <span class=\"na\">spec</span><span class=\"pi\">:</span>   <span class=\"na\">contaiters</span><span class=\"pi\">:</span>   <span class=\"pi\">-</span> <span class=\"na\">name</span><span class=\"pi\">:</span> <span class=\"s\">linkding</span>     <span class=\"na\">image</span><span class=\"pi\">:</span> <span class=\"s\">sissbruecker/linkding:1.44.1</span>     <span class=\"na\">ports</span><span class=\"pi\">:</span>     <span class=\"pi\">-</span> <span class=\"na\">containerPort</span><span class=\"pi\">:</span> <span class=\"m\">9090</span></code></pre></div></div><p>Yeh, you can see it can’t you, damn experts…</p><p>When runing the code initially I was met with a confusing amount of various errors:</p><ul>  <li>“Unknown field in spec.template.spec.contaiters”</li>  <li>“error converting YAML to JSON: YAML: line blah blah blah”</li>  <li>“Mapping values not allowed in this context”</li></ul><p>I made subtle tweaks and changes to the code, resulting in different errors, many visits to Stack Overflow, Google and other search engines with half baked in AI.</p><p>I elected to not actually use AI in this project, partly due to the challenge of actually debugging and fixing the problem and partly because, if you havent noticed YOU are the training data that AI is using, everything you enter is recorded and logged and never deleted unless you take the time to jump through the hoops and actually find the option to permanently remove your data… Dont make the ‘systems’ job easier by feeding it everything about you and what you want.</p><p>If I had the cash and the ability I would absolutely do a PewDiePie and set up a Self Host and do it all locally:</p><div style=\"text-align: center; margin: 2rem 0;\">  <iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/qw4fDU18RcU\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\" style=\"max-width: 100%;\"></iframe></div><p>Lo, I am not rich and My laptop dies often as we all know so back to it</p><h2 id=\"flipping-the-table\">Flipping the table</h2><p>After a few hours, like literally two hours, I decided to give up for now, I had done everything I can think of to get this thing up and running and it just was not budging, I had even used an online YAML checker as part of debugging which is why the error kept changing and that was coming back green saying ‘yeh this is valid YAML my dude’ so I decided to power off the cluster. Gather my thoughts on my notepad and take a break.</p><p>I had planned to do something that day and ended up getting it hammered out, watched some TV and played some games as a distraction.</p><p>Honestly that Game Pass Ultimate at £14.99 a month is a god send, though now it’s going to be £22.99 a month I really have to decide if it’s worth keeping or not, probably will mind.</p><h2 id=\"coming-back-fresh-head\">Coming back fresh head</h2><p>After the rest of that day of ‘relaxing’ I thought it might be fun to play on the laptop a moment, so I opened up ‘ol faithful and staring at me was the notepad…</p><p>There is was, staring me in the face like the end of ‘The Usual Suspects’:</p><hr /><p><img src=\"/assets/blog/Kubernetes-12-hours/kekuausualsuspects.gif\" class=\"align-right\" /></p><p>A SPELLING MISTAKE</p><p>A SPELLING MISTAKE COST ME 3 HOURS OF DEBUGGING</p><p>The Rage at myself, and spellcheck, was able to be measured in that moment</p><p>Gah!</p><hr /><p>So, presenting the correct dep.yaml I made:</p><div class=\"language-yaml highlighter-rouge\"><div class=\"highlight\"><pre class=\"highlight\"><code><span class=\"na\">apiVersion</span><span class=\"pi\">:</span> <span class=\"s\">v1</span><span class=\"na\">kind</span><span class=\"pi\">:</span> <span class=\"s\">Namespace</span><span class=\"na\">metadata</span><span class=\"pi\">:</span> <span class=\"na\">name</span><span class=\"pi\">:</span> <span class=\"s\">linkding</span><span class=\"nn\">---</span><span class=\"na\">apiVersion</span><span class=\"pi\">:</span> <span class=\"s\">apps/v1</span><span class=\"na\">kind</span><span class=\"pi\">:</span> <span class=\"s\">Deployment</span><span class=\"na\">metadata</span><span class=\"pi\">:</span> <span class=\"na\">name</span><span class=\"pi\">:</span> <span class=\"s\">linkding</span> <span class=\"na\">namespace</span><span class=\"pi\">:</span> <span class=\"s\">linkding</span><span class=\"na\">spec</span><span class=\"pi\">:</span> <span class=\"na\">replicas</span><span class=\"pi\">:</span> <span class=\"m\">1</span> <span class=\"na\">selector</span><span class=\"pi\">:</span>  <span class=\"na\">matchLabels</span><span class=\"pi\">:</span>   <span class=\"na\">app</span><span class=\"pi\">:</span> <span class=\"s\">linkding</span> <span class=\"na\">template</span><span class=\"pi\">:</span>  <span class=\"na\">metadata</span><span class=\"pi\">:</span>   <span class=\"na\">labels</span><span class=\"pi\">:</span>    <span class=\"na\">app</span><span class=\"pi\">:</span> <span class=\"s\">linkding</span>  <span class=\"na\">spec</span><span class=\"pi\">:</span>   <span class=\"na\">containers</span><span class=\"pi\">:</span> <span class=\"c1\"># Yes the edit was here...</span>   <span class=\"pi\">-</span> <span class=\"na\">name</span><span class=\"pi\">:</span> <span class=\"s\">linkding</span>     <span class=\"na\">image</span><span class=\"pi\">:</span> <span class=\"s\">sissbruecker/linkding:1.44.1</span>     <span class=\"na\">ports</span><span class=\"pi\">:</span>     <span class=\"pi\">-</span> <span class=\"na\">containerPort</span><span class=\"pi\">:</span> <span class=\"m\">9090</span></code></pre></div></div><p>Then I ran <code class=\"language-plaintext highlighter-rouge\">sudo kubectl apply -f dep.yaml</code> which would install and configure the app based on the yaml input..</p><p>Build complete..</p><p>It actaully did it!</p><p>Happy Dance moment if you please!</p><p>Now not to get too carried away you can check and make sure it is running by entering:</p><div class=\"language-plaintext highlighter-rouge\"><div class=\"highlight\"><pre class=\"highlight\"><code>dm@kb-01:~$ kubectl get podsNo resources found in default namespace.</code></pre></div></div><p>Shit.</p><p>It was at this moment that my debugging came back to mind, search for the answer and you WILL find it, lo and behold I can add <code class=\"language-plaintext highlighter-rouge\">--all-namespace</code> and see everything running:</p><div class=\"language-plaintext highlighter-rouge\"><div class=\"highlight\"><pre class=\"highlight\"><code>dm@kb-01:~$ kubectl get pods --all-namespacesNAMESPACE     NAME                                      READY   STATUS      RESTARTS      AGEkube-system   coredns-64fd4b4794-zf2dp                  1/1     Running     2 (41m ago)   4d8hkube-system   helm-install-traefik-4jxdl                0/1     Completed   2             4d8hkube-system   helm-install-traefik-crd-fqfr7            0/1     Completed   0             4d8hkube-system   local-path-provisioner-774c6665dc-qk9kl   1/1     Running     2 (41m ago)   4d8hkube-system   metrics-server-7bfffcd44-pd2rs            1/1     Running     2 (41m ago)   4d8hkube-system   svclb-traefik-c8216a6a-29ntq              2/2     Running     4 (41m ago)   4d8hkube-system   svclb-traefik-c8216a6a-8ttrg              2/2     Running     4 (39m ago)   4d8hkube-system   svclb-traefik-c8216a6a-xggvm              2/2     Running     4 (40m ago)   4d8hkube-system   traefik-c98fdf6fb-gtv4k                   1/1     Running     2 (41m ago)   4d8hlinkding      linkding-7d4c6f6dbb-nrk9c                 1/1     Running     1 (39m ago)   3d19h</code></pre></div></div><p>Ah that’s better and look linkding is up and rolling, now we’re cooking on gas.</p><p>Now remember that name <code class=\"language-plaintext highlighter-rouge\">linkding-7d4c6f6dbb-nrk9c</code> because we are going to need that.</p><h2 id=\"port-fowarding\">Port Fowarding</h2><p>Now we have a working and live webapp running, we need to be able to access it, turns out you can’t just type in the IP address to your browser and it will suddenly take you there, you need to set up a portforward so you can log into it and access it.</p><p>This process is relatively straight forward if you have a basic understanding of port forwarding so I will drop the commend I used:</p><div class=\"language-plaintext highlighter-rouge\"><div class=\"highlight\"><pre class=\"highlight\"><code>kubectl port-forward pod/linkding-7d4c6f6dbb-nrk9c 9090:9090</code></pre></div></div><p>So we are telling Kubectl (control) to set up a port forward of this particular app or pod and the name of it to a certain port we can access in this case 9090.</p><p>Running it gives little in the way of output as it is in a ‘running’ state, but when you try browsing to it then it will start to fill with logging:</p><p><img src=\"/assets/blog/Kubernetes-12-hours/5.png\" alt=\"5\" class=\"align-center\" /></p><p>And just like that, we have a successful self host!</p><p>I have had some time to play with this and generally, I love it.</p><p>I can’t wait for future me to have money so that I can invest in some Self Host Loving and get a little server up and running with our Plex needs, networking labs, pentesting labs, Kubernetes Clusters and other things.</p><p><img src=\"/assets/blog/Kubernetes-12-hours/6.GIF\" class=\"align-right\" width=\"450\" height=\"315\" /></p><p>Honestly I would be happy with 3 Raspberry Pis and a simple NAS, I can assure you I would have headroom have network wide Ad Blocking and be able to entertain my family.</p><p>If you haven’t considered it before.. look into it. If my haggared laptop can survive long enough to not only do this lab but also survive the write up, you can do it too and learn something.</p><p>I didn’t quite get to scratch that Ai ‘extra mile’ off the list, but it is on the cards. It’s nice to have ‘project work’ in the background, I also have some certs to be studying for.. will see what happens with them.</p><p>Be safe all and I’ll see you in the next post.</p><p>🤙</p><hr /><p>I don’t have any sponsors or anything but if you enjoy my work, or feel sympathy for my wife, then I have set up a <a href=\"https://ko-fi.com/ha3ks\">Ko-Fi account</a> as well as a <a href=\"https://www.buymeacoffee.com/ha3ks\">BuyMeACoffee</a> people can donate to.</p>",
            "url": "https://www.ha3ks.com/kubernetes-from-someone-who-has-12-whole-hours-experience/",
            
            
            
            "tags": ["blog","Kubernetes","DevOps"],
            
            "date_published": "2025-11-01T00:00:00+00:00",
            "date_modified": "2025-11-01T00:00:00+00:00",
            
                "author": "ha3ks"
            
        },
    
        {
            "id": "https://www.ha3ks.com/running-a-fortigate-in-vmware/",
            "title": "Running a FortiGate in VMWare",
            "summary": null,
            "content_text": "It has been some considerable time since I last put up a blog post, I just wanted to go in a different direction for a while, it happens.The direction has been confusing and has me wondering what my next steps will be…I love security don’t get me wrong, it’s the most fun you can have on a computer when you are a nerd and a gamer, but I feel a pull in another direction and as such I want to put up some helpful posts every now and again for people that might want to play with something new.Recently I undertook some free training from Fortinet… you know that company that constantly has exploits and news cycles, that one.I felt a little bad about it but as time has gone on I can kinda see where the problem might be and as such my ‘I can help’ voice took over for a bit…See.. crazy I know.So in the last week I’ve broadened my horizons and learned about AI and Agentic Systems as well as an ‘ass load’ of Fortinet Cybersecurity content.From the latter I wanted to share setting up a Fortigate locally on your machine (Via VMware) so you too can have a play and a poke with it, some features are unavailable however you can set things up and run some stuff through it to see what kinds of fun things you can log and track.PrerequisitesTo install a Fortigate Firewall on VMware Workstation you will first need to register for an Fortinet Support Account so you access the downloads section - https://support.fortinet.com/Download/VMImages.aspx.Once logged in click on Download &gt; VM Images, Select Product: FortiGate and Select Platform: VMware ESXi and download the Latest Version (7.6.4).Be sure to click Download under the ‘New deployment of FortiFirewall for VMware FFW_VM64-v7.6.4.F-build3596-FORTINET.out.ovf.zip (111.94 MB)’ if this is a new installation or VM, if you already have it installed you can grab the one titled ‘Upgrade from previous version of FortiFirewall for VMWare FFW_VM64-v7.6.4.F-build3596-FORTINET.out (112.43 MB)’:Once downloaded you can extract out the files by right clicking and ‘Extract All’ and let it dump out to your download folder:InstallationNow you have done that open VMWare Workstation and select ‘Open a Virtual Machine’:Select your ‘main’ file:And you’llm need to accept the EULA:After hitting Next you will get the option to give the VM a name and where it will be stored (I keep everything in a ‘Virtual Machines’ local folder):Now some guides will have you change the initial ‘Network Adapter’ to NAT, run the VM, log into it and then reset it and do it all over again on round2 because of how the VM licence works.I tried this and completely shafted the install so instead go to the Edit Virtual Machine Settings and under Options, make sure VMware Tools Time Sync, is set to sync with host:And save it, then boot it up!It will run its initial auto config, repartition the disk drive etc etc and eventually spit you out at the login screen.The username is admin, the password is blank… super secure… though when you do log in it asks you to set up a new admin password 😉ConfigurationOnce logged in you can start to do some initial setup, to get this working the following is what I entered:get system status  #Displays a ton of information about the current state of the deviceshow system interface  #Displays the interfaces (ports and access) of the deviceWe need to configure the port and then the default gateway so we can access the device so run the following:config system interfaceedit port1set mode static set ip (your desired IP in my case it was 192.168.4.200) 255.255.255.0set allowaccess https http ping sshendconfig router staticedit 1set device port1set gateway (your desired IP in my case it was 192.168.4.199 as 200 was taken)nextendThat will configure the port and gateway so we can log into the router via the web.The next thing I had an issue with was getting the licence, kept throwing up DNS errors so while we are here, lets configure the DNS:config system dnsset primary 8.8.8.8set secondary 8.8.4.4endNow to be safe you can reboot the device from the VMware menu up top:Once rebooted we can try to log in via the web interface with the admin username and password you have created:Now when you log in you are presented with a setup screen which may also warn that you need a valid licence to use the software, not to worry you can get a free perpetual licence for use from fortigate:Once ‘activated’ you should be brought to the ‘main menu’, the Dashboard of the Fortigate, if not it may take you through a quick little setup side mission but you can skip that part for now.SuccessBehold! Your Dashboard:And that it! Following on from this you can follow along with your training to play around with most parts and sections, again some locked off as its only a perm evaluation licence, but still enough to play around to try new things.Good luck.Peace🤙I don’t have any sponsors or anything but if you enjoy my work, or feel sympathy for my wife, then I have set up a Ko-Fi account as well as a BuyMeACoffee people can donate to.",
            "content_html": "<p>It has been some considerable time since I last put up a blog post, I just wanted to go in a different direction for a while, it happens.</p><p>The direction has been confusing and has me wondering what my next steps will be…</p><p>I love security don’t get me wrong, it’s the most fun you can have on a computer when you are a nerd and a gamer, but I feel a pull in another direction and as such I want to put up some helpful posts every now and again for people that might want to play with something new.</p><p>Recently I undertook some free training from Fortinet… you know that company that constantly has exploits and news cycles, that one.</p><p>I felt a little bad about it but as time has gone on I can kinda see where the problem might be and as such my ‘I can help’ voice took over for a bit…</p><p><img src=\"/assets/blog/FortiVM/1.png\" alt=\"1\" class=\"align-center\" /></p><p>See.. crazy I know.</p><p>So in the last week I’ve broadened my horizons and learned about AI and Agentic Systems as well as an ‘ass load’ of Fortinet Cybersecurity content.</p><p>From the latter I wanted to share setting up a Fortigate locally on your machine (Via VMware) so you too can have a play and a poke with it, some features are unavailable however you can set things up and run some stuff through it to see what kinds of fun things you can log and track.</p><h2 id=\"prerequisites\">Prerequisites</h2><p>To install a Fortigate Firewall on VMware Workstation you will first need to register for an Fortinet Support Account so you access the downloads section - <a href=\"https://support.fortinet.com/Download/VMImages.aspx\">https://support.fortinet.com/Download/VMImages.aspx</a>.</p><p>Once logged in click on Download &gt; VM Images, Select Product: FortiGate and Select Platform: VMware ESXi and download the Latest Version (7.6.4).</p><p>Be sure to click Download under the ‘New deployment of FortiFirewall for VMware FFW_VM64-v7.6.4.F-build3596-FORTINET.out.ovf.zip (111.94 MB)’ if this is a new installation or VM, if you already have it installed you can grab the one titled ‘Upgrade from previous version of FortiFirewall for VMWare FFW_VM64-v7.6.4.F-build3596-FORTINET.out (112.43 MB)’:</p><p><img src=\"/assets/blog/FortiVM/2.png\" alt=\"2\" class=\"align-center\" /></p><p>Once downloaded you can extract out the files by right clicking and ‘Extract All’ and let it dump out to your download folder:</p><p><img src=\"/assets/blog/FortiVM/3.png\" alt=\"3\" class=\"align-center\" /></p><h2 id=\"installation\">Installation</h2><p>Now you have done that open VMWare Workstation and select ‘Open a Virtual Machine’:</p><p><img src=\"/assets/blog/FortiVM/4.png\" alt=\"4\" class=\"align-center\" /></p><p>Select your ‘main’ file:</p><p><img src=\"/assets/blog/FortiVM/5.png\" alt=\"5\" class=\"align-center\" /></p><p>And you’llm need to accept the EULA:</p><p><img src=\"/assets/blog/FortiVM/6.png\" alt=\"6\" class=\"align-center\" /></p><p>After hitting Next you will get the option to give the VM a name and where it will be stored (I keep everything in a ‘Virtual Machines’ local folder):</p><p><img src=\"/assets/blog/FortiVM/7.png\" alt=\"7\" class=\"align-center\" /></p><p>Now some guides will have you change the initial ‘Network Adapter’ to NAT, run the VM, log into it and then reset it and do it all over again on round2 because of how the VM licence works.</p><p>I tried this and completely shafted the install so instead go to the Edit Virtual Machine Settings and under Options, make sure VMware Tools Time Sync, is set to sync with host:</p><p><img src=\"/assets/blog/FortiVM/14.png\" alt=\"14\" class=\"align-center\" /></p><p>And save it, then boot it up!</p><p>It will run its initial auto config, repartition the disk drive etc etc and eventually spit you out at the login screen.</p><p>The username is admin, the password is blank… super secure… though when you do log in it asks you to set up a new admin password 😉</p><p><img src=\"/assets/blog/FortiVM/8.png\" alt=\"8\" class=\"align-center\" /></p><h2 id=\"configuration\">Configuration</h2><p>Once logged in you can start to do some initial setup, to get this working the following is what I entered:</p><div class=\"language-bash highlighter-rouge\"><div class=\"highlight\"><pre class=\"highlight\"><code>get system status  <span class=\"c\">#Displays a ton of information about the current state of the device</span></code></pre></div></div><p><img src=\"/assets/blog/FortiVM/9.png\" alt=\"9\" class=\"align-center\" /></p><div class=\"language-bash highlighter-rouge\"><div class=\"highlight\"><pre class=\"highlight\"><code>show system interface  <span class=\"c\">#Displays the interfaces (ports and access) of the device</span></code></pre></div></div><p><img src=\"/assets/blog/FortiVM/10.png\" alt=\"10\" class=\"align-center\" /></p><p>We need to configure the port and then the default gateway so we can access the device so run the following:</p><div class=\"language-bash highlighter-rouge\"><div class=\"highlight\"><pre class=\"highlight\"><code>config system interfaceedit port1<span class=\"nb\">set </span>mode static <span class=\"nb\">set </span>ip <span class=\"o\">(</span>your desired IP <span class=\"k\">in </span>my <span class=\"k\">case</span> it was 192.168.4.200<span class=\"p\">)</span> 255.255.255.0<span class=\"nb\">set </span>allowaccess https http ping sshendconfig router staticedit 1<span class=\"nb\">set </span>device port1<span class=\"nb\">set </span>gateway <span class=\"o\">(</span>your desired IP <span class=\"k\">in </span>my <span class=\"k\">case</span> it was 192.168.4.199 as 200 was taken<span class=\"p\">)</span>nextend</code></pre></div></div><p>That will configure the port and gateway so we can log into the router via the web.</p><p>The next thing I had an issue with was getting the licence, kept throwing up DNS errors so while we are here, lets configure the DNS:</p><div class=\"language-bash highlighter-rouge\"><div class=\"highlight\"><pre class=\"highlight\"><code>config system dns<span class=\"nb\">set </span>primary 8.8.8.8<span class=\"nb\">set </span>secondary 8.8.4.4end</code></pre></div></div><p>Now to be safe you can reboot the device from the VMware menu up top:</p><p><img src=\"/assets/blog/FortiVM/11.png\" alt=\"11\" class=\"align-center\" /></p><p>Once rebooted we can try to log in via the web interface with the admin username and password you have created:</p><p><img src=\"/assets/blog/FortiVM/12.png\" alt=\"12\" class=\"align-center\" /></p><p>Now when you log in you are presented with a setup screen which may also warn that you need a valid licence to use the software, not to worry you can get a free perpetual licence for use from fortigate:</p><p><img src=\"/assets/blog/FortiVM/13.png\" alt=\"13\" class=\"align-center\" /></p><p>Once ‘activated’ you should be brought to the ‘main menu’, the Dashboard of the Fortigate, if not it may take you through a quick little setup side mission but you can skip that part for now.</p><h2 id=\"success\">Success</h2><p>Behold! Your Dashboard:</p><p><img src=\"/assets/blog/FortiVM/15.png\" alt=\"15\" class=\"align-center\" /></p><p>And that it! Following on from this you can follow along with your training to play around with most parts and sections, again some locked off as its only a perm evaluation licence, but still enough to play around to try new things.</p><p>Good luck.</p><p>Peace</p><p>🤙</p><hr /><p>I don’t have any sponsors or anything but if you enjoy my work, or feel sympathy for my wife, then I have set up a <a href=\"https://ko-fi.com/ha3ks\">Ko-Fi account</a> as well as a <a href=\"https://www.buymeacoffee.com/ha3ks\">BuyMeACoffee</a> people can donate to.</p>",
            "url": "https://www.ha3ks.com/running-a-fortigate-in-vmware/",
            
            
            
            "tags": ["blog","VMWare","Fortigate"],
            
            "date_published": "2025-08-28T00:00:00+00:00",
            "date_modified": "2025-08-28T00:00:00+00:00",
            
                "author": "ha3ks"
            
        },
    
        {
            "id": "https://www.ha3ks.com/building-an-pbx-system/",
            "title": "Building a PBX system",
            "summary": null,
            "content_text": "As a part of my new job I was asked to pickup Asterisk to build a working PBX system (which would then later get a securty and privacy overhawl).As I have some experience with this working in various ISPs over the years, I set about getting started.I know ‘most’ people would want to build this in the cloud but being a ‘penniless nobody’ I set about building this locally which would later lead to some hilarious testing shenannigans, cloud can always come once a solid base and understading has been established.PrerequisitesI knew going into this I would need somekind of server running as well as a client, I figure my machine local can be the client as I can install software like MicroSIP to dial out and as such I decided to grab a copy of Ubuntu Server because it’s what I am most familiar with.A quick and dirty 2 core / 4GB / 24GB server build later and I can SSH into it from my local machine (so set the VM going and minimise/forget about it till done).Now that the connecting part is out of the way I set about reading the Asterisk Documentation and getting the server updated a-la:apt updateapt upgradeInstallationMoving on to the installation of Asterisk, this is actually pretty straightforward and I am borrowing the commands (but updated) from hotkey404.comcd /usr/srcwget http://downloads.asterisk.org/pub/telephony/asterisk/asterisk-22-current.tar.gztar zxvf asterisk-20-current.tar.gzrm -rf asterisk-20-current.tar.gzTo walk though this you are navigating to /usr/src, downloading the latest version of asterisk (at time of creation 22) and then untarring it (unzipping it) and then removing the downloaded .tar.qz (zip) archive.Then we move onto actually installing Asterisk, to do so you need to install some prerequisits first:contrib/scripts/install_prereq installAnd then run your configuration (you can edit this beforehand however I went completely stock which means running everything as defaults and crossing your fingers)../configureNow if that finger crossing worked you will have successfully installed Asterisk if you see something similar to this screen:(Yes it is named differently, I killed the first server from this image by accident but forgot to grab a new picture for the 2nd server).The next thing you will want to install is a firewall, beleive me they are important and for the purposes of my testing we are using IPTables which is a simple Linux Firewall and again guide parts borrowed from dev.to and voip-infoapt install iptablesYou will want to also make sure that you add these specific entries into it to allow asterisk to ‘work’ properly (and yes you can really knuckle down this firewalla and allow or disallow exactly what you want).iptables -A INPUT -p udp -m udp --dport 5060 -j ACCEPTiptables -A INPUT -p udp -m udp --dport 4569 -j ACCEPTiptables -A INPUT -p udp -m udp --dport 5036 -j ACCEPTiptables -A INPUT -p udp -m udp --dport 10000:20000 -j ACCEPTiptables -A INPUT -p udp -m udp --dport 2727 -j ACCEPTNow this is out of the way (and configured the firewall already) lets move onto the ‘configuration’ of AsteriskConfigurationNow that we have made it past installing Asterisk and running the initial config, we can run the installer and select additional options, functionality, the codecs and applications (if any)Accordingly we can run:make menuselectThis will display the Asterisk Module and Build Option Selection menu:As you can see here I have selected the format_mp3 option which will (once installed) save calls to the MP3 format.This was actually the only thing I changed here so if you tab to save and exit at the bottom it will save the changes you made.Now we need to run make and get building:makeThis will take some time to run so do not worry if it is taking a while, once it completes and returns you to the directory you need to run get_mp3_source.sh script located in the contrib/scripts directory. It will download MP3 sources and the necessary libraries to support the MP3 format. It works as follows:LAME sources: The script downloads the sources of the LAME utility, which is used to encode and decode MP3 audio files.Download MAD Sources: MAD (MPEG Audio Decoder) is a library used to decode MP3 files. The script downloads MAD sources.Source Compilation: After downloading the LAME and MAD sources, the script compiles these libraries.Library installation: Once compiled, the script installs the libraries on the system. This allows Asterisk to use these libraries when handling MP3 audio files.MP3 is a copyrighted format, so sources and libraries for its support are not provided with Asterisk.You can run it with the following snip of code:contrib/scripts/get_mp3_source.shOnce complete we can run make install and get this party going:make installOnce complete you will see a screen similar to this:Now onto the fun part:TestingThis section had me in stitches trying to figure out how to call from one SIP to another.Handily man created virtual machines and I rememebered I have one floating about.Now an interesting thing to point out here is that since we did a complete base install of Asterisk with no changes we have some stock credentials stored in it.These are what we will use to log into the SIP system and also call eachother for testing purposes.To access this (as well as starting the services in a moment) we need to navigate to the Asterisk directory:cd /etc/asteriskOnce here we can open the pjsip.conf and view the details, alternatively if you were an Administrator for the system you would go in here to change add or remove users from the system.See lots of details for made up people.So now let’s get Asterisk switched on and working for us.The following commmands need to be ran one time to get things up and running and then again when you make changes:asterisk -r      ## go to the CLI of Asterisk (command line interface where you will run the following commmands)core reload      ## reload pjsip and modulesdialplan reload      ## reload dialplanpjsip show endpoints      ## showis the endpoints you have (if multiple)There are also some simple commands to remember when interacting Asterisk (and yes to can auto on/off etc but that’s for another day)systemctl start asterisk      ## Starts Asterisksystemctl status asterisk      ## Checks Asterisk Statussystemctl stop asterisk      ## Stops AsteriskSo run that Start Asterisk and now with things up and running let’s log into MicroSIP and get working.The following details were used:192.168.84.136 - Server IPusername: 1108 - Caller IDdomain: 192.168.84.136 - Server IP (again)login: DB589C0875AB - User Login for 1100 Password: KAthufrudE6uyAs - Password for 1100Entering these into MicroSIP under ‘add user’And Voilla, logged in and registered:Now I had to try calling from one to the other so here is an example video I got when playing around with a VM:(Aww you can see my notes in the background too lol)All in all a very fun learning experience, took me back to watching the call queues during a large outage at a place I worked once.There were 3 Trunk queues and as things took off and I saw 200 in each queue I bust out my phone and shot a quick video of them all hitting 300, 350, 400, 499 and boom the system went down.Absolutely nothing got done for the rest of that day.Be safe all, working on some things in the background, may have some networking and cloud certs to be hammering thorough soon but I want to be able to share parts of that journey too.Peace🤙I don’t have any sponsors or anything but if you enjoy my work, or feel sympathy for my wife, then I have set up a Ko-Fi account as well as a BuyMeACoffee people can donate to.",
            "content_html": "<p>As a part of my new job I was asked to pickup Asterisk to build a working PBX system (which would then later get a securty and privacy overhawl).</p><p>As I have some experience with this working in various ISPs over the years, I set about getting started.</p><p>I know ‘most’ people would want to build this in the cloud but being a ‘penniless nobody’ I set about building this locally which would later lead to some hilarious testing shenannigans, cloud can always come once a solid base and understading has been established.</p><h2 id=\"prerequisites\">Prerequisites</h2><p>I knew going into this I would need somekind of server running as well as a client, I figure my machine local can be the client as I can install software like <a href=\"https://www.microsip.org/\">MicroSIP</a> to dial out and as such I decided to grab a copy of Ubuntu Server because it’s what I am most familiar with.</p><p>A quick and dirty 2 core / 4GB / 24GB server build later and I can SSH into it from my local machine (so set the VM going and minimise/forget about it till done).</p><p><img src=\"/assets/blog/PBX/ssh.png\" alt=\"SSH\" class=\"align-center\" /></p><p>Now that the connecting part is out of the way I set about reading the <a href=\"https://docs.asterisk.org/\">Asterisk Documentation</a> and getting the server updated a-la:</p><div class=\"language-plaintext highlighter-rouge\"><div class=\"highlight\"><pre class=\"highlight\"><code>apt updateapt upgrade</code></pre></div></div><h2 id=\"installation\">Installation</h2><p>Moving on to the installation of Asterisk, this is actually pretty straightforward and I am borrowing the commands (but updated) from <a href=\"https://hotkey404.com/installing-asterisk-20-from-source-on-ubuntu-23-10/\">hotkey404.com</a></p><div class=\"language-plaintext highlighter-rouge\"><div class=\"highlight\"><pre class=\"highlight\"><code>cd /usr/srcwget http://downloads.asterisk.org/pub/telephony/asterisk/asterisk-22-current.tar.gztar zxvf asterisk-20-current.tar.gzrm -rf asterisk-20-current.tar.gz</code></pre></div></div><p>To walk though this you are navigating to /usr/src, downloading the latest version of asterisk (at time of creation 22) and then untarring it (unzipping it) and then removing the downloaded .tar.qz (zip) archive.</p><p>Then we move onto actually installing Asterisk, to do so you need to install some prerequisits first:</p><div class=\"language-plaintext highlighter-rouge\"><div class=\"highlight\"><pre class=\"highlight\"><code>contrib/scripts/install_prereq install</code></pre></div></div><p>And then run your configuration (you can edit this beforehand however I went completely stock which means running everything as defaults and crossing your fingers).</p><div class=\"language-plaintext highlighter-rouge\"><div class=\"highlight\"><pre class=\"highlight\"><code>./configure</code></pre></div></div><p>Now if that finger crossing worked you will have successfully installed Asterisk if you see something similar to this screen:</p><p><img src=\"/assets/blog/PBX/config.png\" alt=\"config\" class=\"align-center\" /></p><p>(Yes it is named differently, I killed the first server from this image by accident but forgot to grab a new picture for the 2nd server).</p><p>The next thing you will want to install is a firewall, beleive me they are important and for the purposes of my testing we are using IPTables which is a simple Linux Firewall and again guide parts borrowed from <a href=\"https://dev.to/ekim34351855/asterisk-basic-set-up-4ple\">dev.to</a> and <a href=\"https://www.voip-info.org/asterisk-firewall-rules/\">voip-info</a></p><div class=\"language-plaintext highlighter-rouge\"><div class=\"highlight\"><pre class=\"highlight\"><code>apt install iptables</code></pre></div></div><p>You will want to also make sure that you add these specific entries into it to allow asterisk to ‘work’ properly (and yes you can really knuckle down this firewalla and allow or disallow exactly what you want).</p><div class=\"language-plaintext highlighter-rouge\"><div class=\"highlight\"><pre class=\"highlight\"><code>iptables -A INPUT -p udp -m udp --dport 5060 -j ACCEPTiptables -A INPUT -p udp -m udp --dport 4569 -j ACCEPTiptables -A INPUT -p udp -m udp --dport 5036 -j ACCEPTiptables -A INPUT -p udp -m udp --dport 10000:20000 -j ACCEPTiptables -A INPUT -p udp -m udp --dport 2727 -j ACCEPT</code></pre></div></div><p>Now this is out of the way (and configured the firewall already) lets move onto the ‘configuration’ of Asterisk</p><h2 id=\"configuration\">Configuration</h2><p>Now that we have made it past installing Asterisk and running the initial config, we can run the installer and select additional options, functionality, the codecs and applications (if any)</p><p>Accordingly we can run:</p><div class=\"language-plaintext highlighter-rouge\"><div class=\"highlight\"><pre class=\"highlight\"><code>make menuselect</code></pre></div></div><p>This will display the Asterisk Module and Build Option Selection menu:</p><p><img src=\"/assets/blog/PBX/menu.png\" alt=\"menu\" class=\"align-center\" /></p><p>As you can see here I have selected the format_mp3 option which will (once installed) save calls to the MP3 format.</p><p>This was actually the only thing I changed here so if you tab to save and exit at the bottom it will save the changes you made.</p><p>Now we need to run make and get building:</p><div class=\"language-plaintext highlighter-rouge\"><div class=\"highlight\"><pre class=\"highlight\"><code>make</code></pre></div></div><p>This will take some time to run so do not worry if it is taking a while, once it completes and returns you to the directory you need to run get_mp3_source.sh script located in the contrib/scripts directory. It will download MP3 sources and the necessary libraries to support the MP3 format. It works as follows:</p><p>LAME sources: The script downloads the sources of the LAME utility, which is used to encode and decode MP3 audio files.</p><p>Download MAD Sources: MAD (MPEG Audio Decoder) is a library used to decode MP3 files. The script downloads MAD sources.</p><p>Source Compilation: After downloading the LAME and MAD sources, the script compiles these libraries.</p><p>Library installation: Once compiled, the script installs the libraries on the system. This allows Asterisk to use these libraries when handling MP3 audio files.</p><p>MP3 is a copyrighted format, so sources and libraries for its support are not provided with Asterisk.</p><p>You can run it with the following snip of code:</p><div class=\"language-plaintext highlighter-rouge\"><div class=\"highlight\"><pre class=\"highlight\"><code>contrib/scripts/get_mp3_source.sh</code></pre></div></div><p>Once complete we can run make install and get this party going:</p><div class=\"language-plaintext highlighter-rouge\"><div class=\"highlight\"><pre class=\"highlight\"><code>make install</code></pre></div></div><p>Once complete you will see a screen similar to this:</p><p><img src=\"/assets/blog/PBX/complete.png\" alt=\"complete\" class=\"align-center\" /></p><p>Now onto the fun part:</p><h2 id=\"testing\">Testing</h2><p>This section had me in stitches trying to figure out how to call from one SIP to another.</p><p>Handily man created virtual machines and I rememebered I have one floating about.</p><p>Now an interesting thing to point out here is that since we did a complete base install of Asterisk with no changes we have some stock credentials stored in it.</p><p>These are what we will use to log into the SIP system and also call eachother for testing purposes.</p><p>To access this (as well as starting the services in a moment) we need to navigate to the Asterisk directory:</p><div class=\"language-plaintext highlighter-rouge\"><div class=\"highlight\"><pre class=\"highlight\"><code>cd /etc/asterisk</code></pre></div></div><p>Once here we can open the pjsip.conf and view the details, alternatively if you were an Administrator for the system you would go in here to change add or remove users from the system.</p><p><img src=\"/assets/blog/PBX/pjsip.png\" alt=\"pjsip\" class=\"align-center\" /></p><p>See lots of details for made up people.</p><p>So now let’s get Asterisk switched on and working for us.</p><p>The following commmands need to be ran one time to get things up and running and then again when you make changes:</p><div class=\"language-plaintext highlighter-rouge\"><div class=\"highlight\"><pre class=\"highlight\"><code>asterisk -r      ## go to the CLI of Asterisk (command line interface where you will run the following commmands)core reload      ## reload pjsip and modulesdialplan reload      ## reload dialplanpjsip show endpoints      ## showis the endpoints you have (if multiple)</code></pre></div></div><p>There are also some simple commands to remember when interacting Asterisk (and yes to can auto on/off etc but that’s for another day)</p><div class=\"language-plaintext highlighter-rouge\"><div class=\"highlight\"><pre class=\"highlight\"><code>systemctl start asterisk      ## Starts Asterisksystemctl status asterisk      ## Checks Asterisk Statussystemctl stop asterisk      ## Stops Asterisk</code></pre></div></div><p>So run that Start Asterisk and now with things up and running let’s log into MicroSIP and get working.</p><p>The following details were used:</p><div class=\"language-plaintext highlighter-rouge\"><div class=\"highlight\"><pre class=\"highlight\"><code>192.168.84.136 - Server IPusername: 1108 - Caller IDdomain: 192.168.84.136 - Server IP (again)login: DB589C0875AB - User Login for 1100 Password: KAthufrudE6uyAs - Password for 1100</code></pre></div></div><p>Entering these into MicroSIP under ‘add user’</p><p><img src=\"/assets/blog/PBX/microsip.png\" alt=\"microsip\" class=\"align-center\" /></p><p>And Voilla, logged in and registered:</p><p><img src=\"/assets/blog/PBX/sipped.png\" alt=\"sipped\" class=\"align-center\" /></p><p>Now I had to try calling from one to the other so here is an example video I got when playing around with a VM:</p><p><img src=\"https://i.ytimg.com/vi/oF9PQQD4NWc/hqdefault.jpg?sqp=-oaymwFBCNACELwBSFryq4qpAzMIARUAAIhCGAHYAQHiAQoIGBACGAY4AUAB8AEB-AH-CYAC0AWKAgwIABABGDQgZSgUMA8=&amp;rs=AOn4CLAJESlW_AIF_7NHYL2G8bYb1IRzzg\" alt=\"Youtube Upload\" class=\"align-center\" /></p><p>(Aww you can see my notes in the background too lol)</p><p>All in all a very fun learning experience, took me back to watching the call queues during a large outage at a place I worked once.</p><p>There were 3 Trunk queues and as things took off and I saw 200 in each queue I bust out my phone and shot a quick video of them all hitting 300, 350, 400, 499 and boom the system went down.</p><p>Absolutely nothing got done for the rest of that day.</p><p>Be safe all, working on some things in the background, may have some networking and cloud certs to be hammering thorough soon but I want to be able to share parts of that journey too.</p><p>Peace</p><p>🤙</p><hr /><p>I don’t have any sponsors or anything but if you enjoy my work, or feel sympathy for my wife, then I have set up a <a href=\"https://ko-fi.com/ha3ks\">Ko-Fi account</a> as well as a <a href=\"https://www.buymeacoffee.com/ha3ks\">BuyMeACoffee</a> people can donate to.</p>",
            "url": "https://www.ha3ks.com/building-an-pbx-system/",
            
            
            
            "tags": ["blog","pbx","telecommunications"],
            
            "date_published": "2025-07-12T00:00:00+00:00",
            "date_modified": "2025-07-12T00:00:00+00:00",
            
                "author": "ha3ks"
            
        }
    
    ]
}